zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/MIMXRT2661_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT2661CHPAA
**                          MIMXRT2661CVVAA
**                          MIMXRT2661DHPAA
**                          MIMXRT2661DVVAA
**                          MIMXRT2661XHP8A
**                          MIMXRT2661XVV8A
**
**     Compilers:
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    iMXRT2660RM Rev.1 DraftN, 08/2026
**     Version:             rev. 1.0, 2024-11-05
**     Build:               b260818
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MIMXRT2661
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-11-05)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file MIMXRT2661_COMMON.h
 * @version 1.0
 * @date 2024-11-05
 * @brief CMSIS Peripheral Access Layer for MIMXRT2661
 *
 * CMSIS Peripheral Access Layer for MIMXRT2661
 */

#if !defined(MIMXRT2661_COMMON_H_)
#define MIMXRT2661_COMMON_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/* ----------------------------------------------------------------------------
   --
   ---------------------------------------------------------------------------- */

/* XBAR related definitions */
typedef enum
{
    kXBAR_AUDIO     = 1, /*!< AUDIO_XBAR, XBAR in AUDIO_SS */
    kXBAR_HSP_XBAR0 = 2, /*!< HSP_XBAR_0, XBAR in HSP_SS */
    kXBAR_HSP_XBAR1 = 3, /*!< HSP_XBAR_1, XBAR in HSP_SS */
    kXBAR_HSP_XBAR2 = 4, /*!< HSP_XBAR_2, XBAR in HSP_SS */
    kXBAR_WAKE = 5 /*!< WAKE_XBAR, XBAR in WAKE_SS */
} xbar_instance_t;
#define XBAR_INFO \
    { \
        { \
            (volatile uint32_t *)AUDIO__XBAR_BASE, 0x0U, 11U, 0x2CU, 1U \
        }, \
        { \
            (volatile uint32_t *)HSP__XBAR_0_BASE, 0x0U, 261U, 0x414U, 8U \
        }, \
        { \
            (volatile uint32_t *)HSP__XBAR_1_BASE, 0x0U, 64U, 0x100U, 1U \
        }, \
        { \
            (volatile uint32_t *)HSP__XBAR_2_BASE, 0x0U, 40U, 0xA0U, 1U \
        }, \
        { \
            (volatile uint32_t *)WAKE__XBAR_BASE, 0x0U, 35U, 0x8CU, 2U \
        } \
    }



/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 350                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M85 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M85 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M85 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M85 Usage Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M85 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M85 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M85 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M85 System Tick Interrupt */

  /* Device specific interrupts */
  CMPT_CM85_CTI_IRQn           = 0,                /**< CM85: Cti Interrupt Request 0/Cti Interrupt Request 1 */
  Reserved17_IRQn              = 1,                /**< Reserved interrupt 17 */
  Reserved18_IRQn              = 2,                /**< Reserved interrupt 18 */
  CMPT_CM85_ECC_ERROR_IRQn     = 3,                /**< CM85: Single / Multi Bit Ecc Error From L1$ Or Tcm */
  Reserved20_IRQn              = 4,                /**< Reserved interrupt 20 */
  Reserved21_IRQn              = 5,                /**< Reserved interrupt 21 */
  CMPT_CM85_MCM_IRQn           = 6,                /**< CMPT CM85 MCM: Interrupt request */
  CMPT_TRDC_IRQn               = 7,                /**< CMPT TRDC: Interrupt request */
  CMPT_NPU_IRQn                = 8,                /**< CMPT NPU: Interrupt request */
  CMPT_SRAMCTL_0_IRQn          = 9,                /**< CMPT SRAMCTL0: Interrupt request */
  CMPT_SRAMCTL_1_IRQn          = 10,               /**< CMPT SRAMCTL1: Interrupt request */
  CMPT_SRAMCTL_2_IRQn          = 11,               /**< CMPT SRAMCTL2: Interrupt request */
  Reserved28_IRQn              = 12,               /**< Reserved interrupt */
  CMPT_FREQME_IRQn             = 16,               /**< CMPT FREQME: Interrupt request */
  CMPT_LLC_IRQn                = 20,               /**< CMPT LLC: Interrupt request */
  CMPT_DAP_IRQn                = 24,               /**< CMPT DAP: Interrupt request */
  MAIN_TRDC_IRQn               = 25,               /**< MAIN TRDC: Interrupt request */
  MAIN_AHB2AXI_IRQn            = 26,               /**< XHB500: Interrupt On Error Response for a Buffered Or Early Terminated Write */
  MAIN_MMU_IRQn                = 28,               /**< MMU: Interrupt request */
  MAIN_EDMA3_CH0_IRQn          = 29,               /**< MAIN EDMA3: Channel 0 interrupt */
  MAIN_EDMA3_CH1_IRQn          = 30,               /**< MAIN EDMA3: Channel 1 interrupt */
  MAIN_EDMA3_CH2_IRQn          = 31,               /**< MAIN EDMA3: Channel 2 interrupt */
  MAIN_EDMA3_CH3_IRQn          = 32,               /**< MAIN EDMA3: Channel 3 interrupt */
  MAIN_EDMA3_CH4_IRQn          = 33,               /**< MAIN EDMA3: Channel 4 interrupt */
  MAIN_EDMA3_CH5_IRQn          = 34,               /**< MAIN EDMA3: Channel 5 interrupt */
  MAIN_EDMA3_CH6_IRQn          = 35,               /**< MAIN EDMA3: Channel 6 interrupt */
  MAIN_EDMA3_CH7_IRQn          = 36,               /**< MAIN EDMA3: Channel 7 interrupt */
  MAIN_EDMA3_CH8_IRQn          = 37,               /**< MAIN EDMA3: Channel 8 interrupt */
  MAIN_EDMA3_CH9_IRQn          = 38,               /**< MAIN EDMA3: Channel 9 interrupt */
  MAIN_EDMA3_CH10_IRQn         = 39,               /**< MAIN EDMA3: Channel 10 interrupt */
  MAIN_EDMA3_CH11_IRQn         = 40,               /**< MAIN EDMA3: Channel 11 interrupt */
  MAIN_EDMA3_CH12_IRQn         = 41,               /**< MAIN EDMA3: Channel 12 interrupt */
  MAIN_EDMA3_CH13_IRQn         = 42,               /**< MAIN EDMA3: Channel 13 interrupt */
  MAIN_EDMA3_CH14_IRQn         = 43,               /**< MAIN EDMA3: Channel 14 interrupt */
  MAIN_EDMA3_CH15_IRQn         = 44,               /**< MAIN EDMA3: Channel 15 interrupt */
  MAIN_EDMA3_CH16_IRQn         = 45,               /**< MAIN EDMA3: Channel 16 interrupt */
  MAIN_EDMA3_CH17_IRQn         = 46,               /**< MAIN EDMA3: Channel 17 interrupt */
  MAIN_EDMA3_CH18_IRQn         = 47,               /**< MAIN EDMA3: Channel 18 interrupt */
  MAIN_EDMA3_CH19_IRQn         = 48,               /**< MAIN EDMA3: Channel 19 interrupt */
  MAIN_EDMA3_CH20_IRQn         = 49,               /**< MAIN EDMA3: Channel 20 interrupt */
  MAIN_EDMA3_CH21_IRQn         = 50,               /**< MAIN EDMA3: Channel 21 interrupt */
  MAIN_EDMA3_CH22_IRQn         = 51,               /**< MAIN EDMA3: Channel 22 interrupt */
  MAIN_EDMA3_CH23_IRQn         = 52,               /**< MAIN EDMA3: Channel 23 interrupt */
  MAIN_EDMA3_CH24_IRQn         = 53,               /**< MAIN EDMA3: Channel 24 interrupt */
  MAIN_EDMA3_CH25_IRQn         = 54,               /**< MAIN EDMA3: Channel 25 interrupt */
  MAIN_EDMA3_CH26_IRQn         = 55,               /**< MAIN EDMA3: Channel 26 interrupt */
  MAIN_EDMA3_CH27_IRQn         = 56,               /**< MAIN EDMA3: Channel 27 interrupt */
  MAIN_EDMA3_CH28_IRQn         = 57,               /**< MAIN EDMA3: Channel 28 interrupt */
  MAIN_EDMA3_CH29_IRQn         = 58,               /**< MAIN EDMA3: Channel 29 interrupt */
  MAIN_EDMA3_CH30_IRQn         = 59,               /**< MAIN EDMA3: Channel 30 interrupt */
  MAIN_EDMA3_CH31_IRQn         = 60,               /**< MAIN EDMA3: Channel 31 interrupt */
  MAIN_EDMA5_CH0_IRQn          = 61,               /**< MAIN EDMA5: Channel 0 interrupt */
  MAIN_EDMA5_CH1_IRQn          = 62,               /**< MAIN EDMA5: Channel 1 interrupt */
  MAIN_EDMA5_CH2_IRQn          = 63,               /**< MAIN EDMA5: Channel 2 interrupt */
  MAIN_EDMA5_CH3_IRQn          = 64,               /**< MAIN EDMA5: Channel 3 interrupt */
  MAIN_EDMA5_CH4_IRQn          = 65,               /**< MAIN EDMA5: Channel 4 interrupt */
  MAIN_EDMA5_CH5_IRQn          = 66,               /**< MAIN EDMA5: Channel 5 interrupt */
  MAIN_EDMA5_CH6_IRQn          = 67,               /**< MAIN EDMA5: Channel 6 interrupt */
  MAIN_EDMA5_CH7_IRQn          = 68,               /**< MAIN EDMA5: Channel 7 interrupt */
  MAIN_EDMA5_CH8_IRQn          = 69,               /**< MAIN EDMA5: Channel 8 interrupt */
  MAIN_EDMA5_CH9_IRQn          = 70,               /**< MAIN EDMA5: Channel 9 interrupt */
  MAIN_EDMA5_CH10_IRQn         = 71,               /**< MAIN EDMA5: Channel 10 interrupt */
  MAIN_EDMA5_CH11_IRQn         = 72,               /**< MAIN EDMA5: Channel 11 interrupt */
  MAIN_EDMA5_CH12_IRQn         = 73,               /**< MAIN EDMA5: Channel 12 interrupt */
  MAIN_EDMA5_CH13_IRQn         = 74,               /**< MAIN EDMA5: Channel 13 interrupt */
  MAIN_EDMA5_CH14_IRQn         = 75,               /**< MAIN EDMA5: Channel 14 interrupt */
  MAIN_EDMA5_CH15_IRQn         = 76,               /**< MAIN EDMA5: Channel 15 interrupt */
  MAIN_FREQME_IRQn             = 77,               /**< MAIN FREQME: interrupt request */
  HSP_STM_IRQn                 = 78,               /**< HSP STM: Interrupt request */
  MAIN_XSPI0_IRQn              = 82,               /**< MAIN XSPI0: interrupt request */
  MAIN_XSPI1_IRQn              = 83,               /**< MAIN XSPI1: interrupt request */
  SYSCON_CGU_INT0_IRQn         = 86,               /**< CGU: Vdda 0V8 Status Interrupt */
  SYSCON_CGU_INT1_IRQn         = 87,               /**< CGU: Audiopll Dnum Update Done Interrupt */
  SYSCON_CGU_INT2_IRQn         = 88,               /**< CGU: Videopll Dnum Update Done Interrupt */
  MAIN_CSSI_IRQn               = 89,               /**< CSSI:Status/Error Interrupt/Active Interrupt */
  MAIN_CSSI_SENTMU0A_IRQn      = 90,               /**< CSSI_MU: MU0A Ored Tx Interrupt To Mua */
  MAIN_CSSI_SENTMU1A_IRQn      = 91,               /**< CSSI_MU: Mu1A Ored Tx Interrupt To Mua */
  SYSCON_PMU_INT0_IRQn         = 93,               /**< PMU: Ored All Sensor And Monitor Interrupts */
  SYSCON_PMU_INT1_IRQn         = 94,               /**< PMU: Body Bias Interrupt */
  SYSCON_RESETCON_IRQn         = 95,               /**< SYSCON RESETCON: Interrupt request */
  SYSCON_FREQME_IRQn           = 96,               /**< SYSCON FREQME: Interrupt request */
  HSP_XBAR0_CH0_IRQn           = 100,              /**< HSP XBAR0 Channel 0 interrupt */
  HSP_XBAR0_CH1_IRQn           = 101,              /**< HSP XBAR0 Channel 1 interrupt */
  HSP_XBAR0_CH2_IRQn           = 102,              /**< HSP XBAR0 Channel 2 interrupt */
  HSP_XBAR0_CH3_IRQn           = 103,              /**< HSP XBAR0 Channel 3 interrupt */
  HSP_XBAR0_CH4_IRQn           = 104,              /**< HSP XBAR0 Channel 4 interrupt */
  HSP_XBAR0_CH5_IRQn           = 105,              /**< HSP XBAR0 Channel 5 interrupt */
  HSP_XBAR0_CH6_IRQn           = 106,              /**< HSP XBAR0 Channel 6 interrupt */
  HSP_XBAR0_CH7_IRQn           = 107,              /**< HSP XBAR0 Channel 7 interrupt */
  HSP_ADC0_IRQn                = 112,              /**< HSP ADC0 interrupt */
  HSP_ADC1_IRQn                = 113,              /**< HSP ADC1 interrupt */
  HSP_DAC_IRQn                 = 114,              /**< HSP DAC interrupt */
  HSP_LPIT0_IRQn               = 115,              /**< HSP LPIT0 interrupt */
  HSP_LPIT1_IRQn               = 116,              /**< HSP LPIT1 interrupt */
  HSP_EFLEXPWM0_CH0_IRQn       = 117,              /**< HSP EFLEXPWM0 channel 0 interrupt */
  HSP_EFLEXPWM0_CH1_IRQn       = 118,              /**< HSP EFLEXPWM0 channel 1 interrupt */
  HSP_EFLEXPWM0_CH2_IRQn       = 119,              /**< HSP EFLEXPWM0 channel 2 interrupt */
  HSP_EFLEXPWM0_CH3_IRQn       = 120,              /**< HSP EFLEXPWM0 channel 3 interrupt */
  HSP_EFLEXPWM0_ERROR_IRQn     = 121,              /**< HSP EFLEXPWM0 fault interrupt */
  HSP_EFLEXPWM1_CH0_IRQn       = 122,              /**< HSP EFLEXPWM1 channel 0 interrupt */
  HSP_EFLEXPWM1_CH1_IRQn       = 123,              /**< HSP EFLEXPWM1 channel 1 interrupt */
  HSP_EFLEXPWM1_CH2_IRQn       = 124,              /**< HSP EFLEXPWM1 channel 2 interrupt */
  HSP_EFLEXPWM1_CH3_IRQn       = 125,              /**< HSP EFLEXPWM1 channel 3 interrupt */
  HSP_EFLEXPWM1_ERROR_IRQn     = 126,              /**< HSP EFLEXPWM1 fault interrupt */
  HSP_EFLEXPWM2_CH0_IRQn       = 127,              /**< HSP EFLEXPWM2 channel 0 interrupt */
  HSP_EFLEXPWM2_CH1_IRQn       = 128,              /**< HSP EFLEXPWM2 channel 1 interrupt */
  HSP_EFLEXPWM2_CH2_IRQn       = 129,              /**< HSP EFLEXPWM2 channel 2 interrupt */
  HSP_EFLEXPWM2_CH3_IRQn       = 130,              /**< HSP EFLEXPWM2 channel 3 interrupt */
  HSP_EFLEXPWM2_ERROR_IRQn     = 131,              /**< HSP EFLEXPWM2 fault interrupt */
  HSP_EFLEXPWM3_CH0_IRQn       = 132,              /**< HSP EFLEXPWM3 channel 0 interrupt */
  HSP_EFLEXPWM3_CH1_IRQn       = 133,              /**< HSP EFLEXPWM3 channel 1 interrupt */
  HSP_EFLEXPWM3_CH2_IRQn       = 134,              /**< HSP EFLEXPWM3 channel 2 interrupt */
  HSP_EFLEXPWM3_CH3_IRQn       = 135,              /**< HSP EFLEXPWM3 channel 3 interrupt */
  HSP_EFLEXPWM3_ERROR_IRQn     = 136,              /**< HSP EFLEXPWM3 fault interrupt */
  HSP_QTPM0_IRQn               = 137,              /**< HSP QUADTPM0 interrupt */
  HSP_QTPM1_IRQn               = 138,              /**< HSP QUADTPM1 interrupt */
  HSP_QTPM2_IRQn               = 139,              /**< HSP QUADTPM2 interrupt */
  HSP_QTPM3_IRQn               = 140,              /**< HSP QUADTPM3 interrupt */
  HSP_QTMR0_IRQn               = 149,              /**< HSP QUADTMR0 interrupt */
  HSP_QTMR1_IRQn               = 150,              /**< HSP QUADTMR1 interrupt */
  HSP_QTMR2_IRQn               = 151,              /**< HSP QUADTMR2 interrupt */
  HSP_QTMR3_IRQn               = 152,              /**< HSP QUADTMR3 interrupt */
  HSP_EQDC0_IRQn               = 153,              /**< HSP EQDC0 interrupt */
  HSP_EQDC1_IRQn               = 154,              /**< HSP EQDC1 interrupt */
  HSP_EQDC2_IRQn               = 155,              /**< HSP EQDC2 interrupt */
  HSP_EQDC3_IRQn               = 156,              /**< HSP EQDC3 interrupt */
  HSP_SINC0_CH0_IRQn           = 157,              /**< HSP SINC0 channel 0 interrupt */
  HSP_SINC0_CH1_IRQn           = 158,              /**< HSP SINC0 channel 1 interrupt */
  HSP_SINC0_CH2_IRQn           = 159,              /**< HSP SINC0 channel 2 interrupt */
  HSP_SINC0_CH3_IRQn           = 160,              /**< HSP SINC0 channel 3 interrupt */
  HSP_SINC1_CH0_IRQn           = 161,              /**< HSP SINC1 channel 0 interrupt */
  HSP_SINC1_CH1_IRQn           = 162,              /**< HSP SINC1 channel 1 interrupt */
  HSP_SINC1_CH2_IRQn           = 163,              /**< HSP SINC1 channel 2 interrupt */
  HSP_SINC1_CH3_IRQn           = 164,              /**< HSP SINC1 channel 3 interrupt */
  HSP_FLEXCAN0_IRQn            = 165,              /**< HSP FLEXCAN0 interrupt */
  HSP_FLEXCAN0_ERROR_IRQn      = 166,              /**< HSP FLEXCAN0 error interrupt */
  HSP_FLEXCAN1_IRQn            = 167,              /**< HSP FLEXCAN1 interrupt */
  HSP_FLEXCAN1_ERROR_IRQn      = 168,              /**< HSP FLEXCAN1 error interrupt */
  HSP_FLEXCAN2_IRQn            = 169,              /**< HSP FLEXCAN2 interrupt */
  HSP_FLEXCAN2_ERROR_IRQn      = 170,              /**< HSP FLEXCAN2 error interrupt */
  HSP_FLEXIO0_IRQn             = 171,              /**< HSP FLEXIO0 interrupt */
  HSP_FLEXIO1_IRQn             = 172,              /**< HSP FLEXIO1 interrupt */
  HSP_FLEXIO2_IRQn             = 173,              /**< HSP FLEXIO2 interrupt */
  HSP_I3C_IRQn                 = 174,              /**< HSP I3C interrupt */
  HSP_LPI2C0_IRQn              = 175,              /**< HSP LPI2C0 interrupt */
  HSP_LPI2C1_IRQn              = 176,              /**< HSP LPI2C1 interrupt */
  Reserved193_IRQn             = 177,              /**< Reserved interrupt */
  Reserved194_IRQn             = 178,              /**< Reserved interrupt */
  HSP_LPSPI0_IRQn              = 179,              /**< HSP LPSPI0 interrupt */
  HSP_LPSPI1_IRQn              = 180,              /**< HSP LPSPI1 interrupt */
  HSP_LPSPI2_IRQn              = 181,              /**< HSP LPSPI2 interrupt */
  HSP_LPSPI3_IRQn              = 182,              /**< HSP LPSPI3 interrupt */
  HSP_LPSPI4_IRQn              = 183,              /**< HSP LPSPI4 interrupt */
  HSP_LPUART0_IRQn             = 184,              /**< HSP LPUART0 interrupt */
  HSP_LPUART1_IRQn             = 185,              /**< HSP LPUART1 interrupt */
  HSP_LPUART2_IRQn             = 186,              /**< HSP LPUART2 interrupt */
  HSP_LPUART3_IRQn             = 187,              /**< HSP LPUART3 interrupt */
  HSP_LPUART4_IRQn             = 188,              /**< HSP LPUART4 interrupt */
  HSP_LPUART5_IRQn             = 189,              /**< HSP LPUART5 interrupt */
  HSP_GPIO0_CH0_IRQn           = 190,              /**< HSP GPIO0 channel 0 interrupt */
  HSP_GPIO0_CH1_IRQn           = 191,              /**< HSP GPIO0 channel 1 interrupt */
  HSP_GPIO1_CH0_IRQn           = 192,              /**< HSP GPIO1 channel 0 interrupt */
  HSP_GPIO1_CH1_IRQn           = 193,              /**< HSP GPIO1 channel 1 interrupt */
  HSP_GPIO2_CH0_IRQn           = 194,              /**< HSP GPIO2 channel 0 interrupt */
  HSP_GPIO2_CH1_IRQn           = 195,              /**< HSP GPIO2 channel 1 interrupt */
  HSP_GPIO3_CH0_IRQn           = 196,              /**< HSP GPIO3 channel 0 interrupt */
  HSP_GPIO3_CH1_IRQn           = 197,              /**< HSP GPIO3 channel 1 interrupt */
  HSP_GPIO4_CH0_IRQn           = 198,              /**< HSP GPIO4 channel 0 interrupt */
  HSP_GPIO4_CH1_IRQn           = 199,              /**< HSP GPIO4 channel 1 interrupt */
  Reserved216_IRQn             = 200,              /**< Reserved interrupt */
  Reserved217_IRQn             = 201,              /**< Reserved interrupt */
  Reserved218_IRQn             = 202,              /**< Reserved interrupt */
  Reserved219_IRQn             = 203,              /**< Reserved interrupt */
  WAKE_TRDC_IRQn               = 205,              /**< WAKE TRDC interrupt */
  WAKE_XBAR_CH0_IRQn           = 206,              /**< WAKE XBAR channel 0 interrupt */
  WAKE_XBAR_CH1_IRQn           = 207,              /**< WAKE XBAR channel 1 interrupt */
  WAKE_EDMA3_CH0_IRQn          = 208,              /**< WAKE EDMA3: Channel 0 interrupt */
  WAKE_EDMA3_CH1_IRQn          = 209,              /**< WAKE EDMA3: Channel 1 interrupt */
  WAKE_EDMA3_CH2_IRQn          = 210,              /**< WAKE EDMA3: Channel 2 interrupt */
  WAKE_EDMA3_CH3_IRQn          = 211,              /**< WAKE EDMA3: Channel 3 interrupt */
  WAKE_EDMA3_CH4_IRQn          = 212,              /**< WAKE EDMA3: Channel 4 interrupt */
  WAKE_EDMA3_CH5_IRQn          = 213,              /**< WAKE EDMA3: Channel 5 interrupt */
  WAKE_EDMA3_CH6_IRQn          = 214,              /**< WAKE EDMA3: Channel 6 interrupt */
  WAKE_EDMA3_CH7_IRQn          = 215,              /**< WAKE EDMA3: Channel 7 interrupt */
  WAKE_ACMP0_IRQn              = 216,              /**< WAKE CMP0 interrupt */
  WAKE_ACMP1_IRQn              = 217,              /**< WAKE CMP1 interrupt */
  WAKE_ACMP2_IRQn              = 218,              /**< WAKE CMP2 interrupt */
  WAKE_ACMP3_IRQn              = 219,              /**< WAKE CMP3 interrupt */
  WAKE_EWM_IRQn                = 220,              /**< WAKE EWM interrupt */
  WAKE_FREQME_IRQn             = 221,              /**< WAKE FREQME interrupt */
  WAKE_LPTMR0_IRQn             = 222,              /**< WAKE LPTMR0 interrupt */
  WAKE_LPTMR1_IRQn             = 223,              /**< WAKE LPTMR1 interrupt */
  WAKE_QTPM0_IRQn              = 224,              /**< WAKE QTPM0 interrupt */
  WAKE_QTPM1_IRQn              = 225,              /**< WAKE QTPM1 interrupt */
  WAKE_QTPM2_IRQn              = 226,              /**< WAKE QTPM2 interrupt */
  WAKE_QTPM3_IRQn              = 227,              /**< WAKE QTPM3 interrupt */
  WAKE_SWT0_IRQn               = 228,              /**< WAKE SWT0 interrupt */
  WAKE_SWT1_IRQn               = 229,              /**< WAKE SWT1 interrupt */
  Reserved246_IRQn             = 230,              /**< Reserved interrupt */
  Reserved247_IRQn             = 231,              /**< Reserved interrupt */
  WAKE_I3C_IRQn                = 234,              /**< WAKE I3C interrupt */
  WAKE_LPI2C0_IRQn             = 235,              /**< WAKE LPI2C0 interrupt */
  WAKE_LPI2C1_IRQn             = 236,              /**< WAKE LPI2C1 interrupt */
  WAKE_LPSPI_IRQn              = 237,              /**< WAKE LPSPI interrupt */
  WAKE_LPUART0_IRQn            = 238,              /**< WAKE LPUART0 interrupt */
  WAKE_LPUART1_IRQn            = 239,              /**< WAKE LPUART1 interrupt */
  WAKE_GPIO_CH0_IRQn           = 240,              /**< WAKE GPIO channel 0 interrupt */
  WAKE_GPIO_CH1_IRQn           = 241,              /**< WAKE GPIO channel 1 interrupt */
  WAKE_PDM_EVENT_IRQn          = 242,              /**< WAKE MICIFL  Filter Results Available (Fifo) Interrupt/ */
  WAKE_PDM_ERROR_IRQn          = 243,              /**< WAKE MICIFL Error interrupt */
  WAKE_PDM_HWVAD_EVENT_IRQn    = 244,              /**< WAKE MICIFL Hwvad Activation interrupt */
  WAKE_PDM_HWVAD_ERROR_IRQn    = 245,              /**< WAKE MICIFL Hwvad Exception Interrupt */
  VBAT_BBSM_INT0_IRQn          = 247,              /**< BBSM: Alarm interrupt0 */
  VBAT_TDET_IRQn               = 249,              /**< VBAT TDET interrupt */
  VBAT_LPTMR_IRQn              = 250,              /**< VBAT LPTMR interrupt */
  VBAT_RTC_IRQn                = 251,              /**< VBAT RTC interrupt */
  VBAT_GPIO_CH0_IRQn           = 252,              /**< VBAT GPIO channel 0 interrupt */
  VBAT_GPIO_CH1_IRQn           = 253,              /**< VBAT GPIO channel 1 interrupt */
  VBAT_VBATCON_IRQn            = 254,              /**< vbatcon Interrupt Request */
  AUDIO_TRDC_IRQn              = 255,              /**< AUDIO TRDC interrupt */
  AUDIO_SAI0_IRQn              = 256,              /**< AUDIO SAI0 interrupt */
  AUDIO_SAI1_IRQn              = 257,              /**< AUDIO SAI1 interrupt */
  AUDIO_SAI2_IRQn              = 258,              /**< AUDIO SAI2 interrupt */
  AUDIO_PDM_EVENT_IRQn         = 262,              /**< AUDIO MICDIL Filter Results Available (Fifo) Interrupt */
  AUDIO_PDM_ERROR_IRQn         = 263,              /**< AUDIO MICDIL Error interrupt */
