zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/MIMXRT2661_COMMON.h
    kHSP__XBAR_2_InputRESERVED99    = 99|0x40000U, /**< HSP_XBAR_2_IN99 input is reserved. */
    kHSP__XBAR_2_InputRESERVED100   = 100|0x40000U, /**< HSP_XBAR_2_IN100 input is reserved. */
    kHSP__XBAR_2_InputRESERVED101   = 101|0x40000U, /**< HSP_XBAR_2_IN101 input is reserved. */
    kHSP__XBAR_2_InputRESERVED102   = 102|0x40000U, /**< HSP_XBAR_2_IN102 input is reserved. */
    kHSP__XBAR_2_InputRESERVED103   = 103|0x40000U, /**< HSP_XBAR_2_IN103 input is reserved. */
    kHSP__XBAR_2_InputRESERVED104   = 104|0x40000U, /**< HSP_XBAR_2_IN104 input is reserved. */
    kHSP__XBAR_2_InputRESERVED105   = 105|0x40000U, /**< HSP_XBAR_2_IN105 input is reserved. */
    kHSP__XBAR_2_InputHspQtmr0Out0  = 106|0x40000U, /**< HSP_QTMR0_OUT0 output assigned to HSP_XBAR_2_IN106 input. */
    kHSP__XBAR_2_InputHspQtmr0Out1  = 107|0x40000U, /**< HSP_QTMR0_OUT1 output assigned to HSP_XBAR_2_IN107 input. */
    kHSP__XBAR_2_InputHspQtmr0Out2  = 108|0x40000U, /**< HSP_QTMR0_OUT2 output assigned to HSP_XBAR_2_IN108 input. */
    kHSP__XBAR_2_InputHspQtmr0Out3  = 109|0x40000U, /**< HSP_QTMR0_OUT3 output assigned to HSP_XBAR_2_IN109 input. */
    kHSP__XBAR_2_InputHspQtmr1Out0  = 110|0x40000U, /**< HSP_QTMR1_OUT0 output assigned to HSP_XBAR_2_IN110 input. */
    kHSP__XBAR_2_InputHspQtmr1Out1  = 111|0x40000U, /**< HSP_QTMR1_OUT1 output assigned to HSP_XBAR_2_IN111 input. */
    kHSP__XBAR_2_InputHspQtmr1Out2  = 112|0x40000U, /**< HSP_QTMR1_OUT2 output assigned to HSP_XBAR_2_IN112 input. */
    kHSP__XBAR_2_InputHspQtmr1Out3  = 113|0x40000U, /**< HSP_QTMR1_OUT3 output assigned to HSP_XBAR_2_IN113 input. */
    kHSP__XBAR_2_InputHspQtmr2Out0  = 114|0x40000U, /**< HSP_QTMR2_OUT0 output assigned to HSP_XBAR_2_IN114 input. */
    kHSP__XBAR_2_InputHspQtmr2Out1  = 115|0x40000U, /**< HSP_QTMR2_OUT1 output assigned to HSP_XBAR_2_IN115 input. */
    kHSP__XBAR_2_InputHspQtmr2Out2  = 116|0x40000U, /**< HSP_QTMR2_OUT2 output assigned to HSP_XBAR_2_IN116 input. */
    kHSP__XBAR_2_InputHspQtmr2Out3  = 117|0x40000U, /**< HSP_QTMR2_OUT3 output assigned to HSP_XBAR_2_IN117 input. */
    kHSP__XBAR_2_InputHspQtmr3Out0  = 118|0x40000U, /**< HSP_QTMR3_OUT0 output assigned to HSP_XBAR_2_IN118 input. */
    kHSP__XBAR_2_InputHspQtmr3Out1  = 119|0x40000U, /**< HSP_QTMR3_OUT1 output assigned to HSP_XBAR_2_IN119 input. */
    kHSP__XBAR_2_InputHspQtmr3Out2  = 120|0x40000U, /**< HSP_QTMR3_OUT2 output assigned to HSP_XBAR_2_IN120 input. */
    kHSP__XBAR_2_InputHspQtmr3Out3  = 121|0x40000U, /**< HSP_QTMR3_OUT3 output assigned to HSP_XBAR_2_IN121 input. */
    kHSP__XBAR_2_InputHspQdec0PosMatch0 = 122|0x40000U, /**< HSP_QDEC0_POS_MATCH0 output assigned to HSP_XBAR_2_IN122 input. */
    kHSP__XBAR_2_InputHspQdec0PosMatch1 = 123|0x40000U, /**< HSP_QDEC0_POS_MATCH1 output assigned to HSP_XBAR_2_IN123 input. */
    kHSP__XBAR_2_InputHspQdec0PosMatch2 = 124|0x40000U, /**< HSP_QDEC0_POS_MATCH2 output assigned to HSP_XBAR_2_IN124 input. */
    kHSP__XBAR_2_InputHspQdec0PosMatch3 = 125|0x40000U, /**< HSP_QDEC0_POS_MATCH3 output assigned to HSP_XBAR_2_IN125 input. */
    kHSP__XBAR_2_InputHspQdec0CompFlg0 = 126|0x40000U, /**< HSP_QDEC0_COMP_FLG0 output assigned to HSP_XBAR_2_IN126 input. */
    kHSP__XBAR_2_InputHspQdec0CompFlg1 = 127|0x40000U, /**< HSP_QDEC0_COMP_FLG1 output assigned to HSP_XBAR_2_IN127 input. */
    kHSP__XBAR_2_InputHspQdec0CompFlg2 = 128|0x40000U, /**< HSP_QDEC0_COMP_FLG2 output assigned to HSP_XBAR_2_IN128 input. */
    kHSP__XBAR_2_InputHspQdec0CompFlg3 = 129|0x40000U, /**< HSP_QDEC0_COMP_FLG3 output assigned to HSP_XBAR_2_IN129 input. */
    kHSP__XBAR_2_InputHspQdec0Dir   = 130|0x40000U, /**< HSP_QDEC0_DIR output assigned to HSP_XBAR_2_IN130 input. */
    kHSP__XBAR_2_InputHspQdec0CntUp = 131|0x40000U, /**< HSP_QDEC0_CNT_UP output assigned to HSP_XBAR_2_IN131 input. */
    kHSP__XBAR_2_InputHspQdec0CntDown = 132|0x40000U, /**< HSP_QDEC0_CNT_DOWN output assigned to HSP_XBAR_2_IN132 input. */
    kHSP__XBAR_2_InputHspQdec1PosMatch0 = 133|0x40000U, /**< HSP_QDEC1_POS_MATCH0 output assigned to HSP_XBAR_2_IN133 input. */
    kHSP__XBAR_2_InputHspQdec1PosMatch1 = 134|0x40000U, /**< HSP_QDEC1_POS_MATCH1 output assigned to HSP_XBAR_2_IN134 input. */
    kHSP__XBAR_2_InputHspQdec1PosMatch2 = 135|0x40000U, /**< HSP_QDEC1_POS_MATCH2 output assigned to HSP_XBAR_2_IN135 input. */
    kHSP__XBAR_2_InputHspQdec1PosMatch3 = 136|0x40000U, /**< HSP_QDEC1_POS_MATCH3 output assigned to HSP_XBAR_2_IN136 input. */
    kHSP__XBAR_2_InputHspQdec1CompFlg0 = 137|0x40000U, /**< HSP_QDEC1_COMP_FLG0 output assigned to HSP_XBAR_2_IN137 input. */
    kHSP__XBAR_2_InputHspQdec1CompFlg1 = 138|0x40000U, /**< HSP_QDEC1_COMP_FLG1 output assigned to HSP_XBAR_2_IN138 input. */
    kHSP__XBAR_2_InputHspQdec1CompFlg2 = 139|0x40000U, /**< HSP_QDEC1_COMP_FLG2 output assigned to HSP_XBAR_2_IN139 input. */
    kHSP__XBAR_2_InputHspQdec1CompFlg3 = 140|0x40000U, /**< HSP_QDEC1_COMP_FLG3 output assigned to HSP_XBAR_2_IN140 input. */
    kHSP__XBAR_2_InputHspQdec1Dir   = 141|0x40000U, /**< HSP_QDEC1_DIR output assigned to HSP_XBAR_2_IN141 input. */
    kHSP__XBAR_2_InputHspQdec1CntUp = 142|0x40000U, /**< HSP_QDEC1_CNT_UP output assigned to HSP_XBAR_2_IN142 input. */
    kHSP__XBAR_2_InputHspQdec1CntDown = 143|0x40000U, /**< HSP_QDEC1_CNT_DOWN output assigned to HSP_XBAR_2_IN143 input. */
    kHSP__XBAR_2_InputHspQdec2PosMatch0 = 144|0x40000U, /**< HSP_QDEC2_POS_MATCH0 output assigned to HSP_XBAR_2_IN144 input. */
    kHSP__XBAR_2_InputHspQdec2PosMatch1 = 145|0x40000U, /**< HSP_QDEC2_POS_MATCH1 output assigned to HSP_XBAR_2_IN145 input. */
    kHSP__XBAR_2_InputHspQdec2PosMatch2 = 146|0x40000U, /**< HSP_QDEC2_POS_MATCH2 output assigned to HSP_XBAR_2_IN146 input. */
    kHSP__XBAR_2_InputHspQdec2PosMatch3 = 147|0x40000U, /**< HSP_QDEC2_POS_MATCH3 output assigned to HSP_XBAR_2_IN147 input. */
    kHSP__XBAR_2_InputHspQdec2CompFlg0 = 148|0x40000U, /**< HSP_QDEC2_COMP_FLG0 output assigned to HSP_XBAR_2_IN148 input. */
    kHSP__XBAR_2_InputHspQdec2CompFlg1 = 149|0x40000U, /**< HSP_QDEC2_COMP_FLG1 output assigned to HSP_XBAR_2_IN149 input. */
    kHSP__XBAR_2_InputHspQdec2CompFlg2 = 150|0x40000U, /**< HSP_QDEC2_COMP_FLG2 output assigned to HSP_XBAR_2_IN150 input. */
    kHSP__XBAR_2_InputHspQdec2CompFlg3 = 151|0x40000U, /**< HSP_QDEC2_COMP_FLG3 output assigned to HSP_XBAR_2_IN151 input. */
    kHSP__XBAR_2_InputHspQdec2Dir   = 152|0x40000U, /**< HSP_QDEC2_DIR output assigned to HSP_XBAR_2_IN152 input. */
    kHSP__XBAR_2_InputHspQdec2CntUp = 153|0x40000U, /**< HSP_QDEC2_CNT_UP output assigned to HSP_XBAR_2_IN153 input. */
    kHSP__XBAR_2_InputHspQdec2CntDown = 154|0x40000U, /**< HSP_QDEC2_CNT_DOWN output assigned to HSP_XBAR_2_IN154 input. */
    kHSP__XBAR_2_InputHspQdec3PosMatch0 = 155|0x40000U, /**< HSP_QDEC3_POS_MATCH0 output assigned to HSP_XBAR_2_IN155 input. */
    kHSP__XBAR_2_InputHspQdec3PosMatch1 = 156|0x40000U, /**< HSP_QDEC3_POS_MATCH1 output assigned to HSP_XBAR_2_IN156 input. */
    kHSP__XBAR_2_InputHspQdec3PosMatch2 = 157|0x40000U, /**< HSP_QDEC3_POS_MATCH2 output assigned to HSP_XBAR_2_IN157 input. */
    kHSP__XBAR_2_InputHspQdec3PosMatch3 = 158|0x40000U, /**< HSP_QDEC3_POS_MATCH3 output assigned to HSP_XBAR_2_IN158 input. */
    kHSP__XBAR_2_InputHspQdec3CompFlg0 = 159|0x40000U, /**< HSP_QDEC3_COMP_FLG0 output assigned to HSP_XBAR_2_IN159 input. */
    kHSP__XBAR_2_InputHspQdec3CompFlg1 = 160|0x40000U, /**< HSP_QDEC3_COMP_FLG1 output assigned to HSP_XBAR_2_IN160 input. */
    kHSP__XBAR_2_InputHspQdec3CompFlg2 = 161|0x40000U, /**< HSP_QDEC3_COMP_FLG2 output assigned to HSP_XBAR_2_IN161 input. */
    kHSP__XBAR_2_InputHspQdec3CompFlg3 = 162|0x40000U, /**< HSP_QDEC3_COMP_FLG3 output assigned to HSP_XBAR_2_IN162 input. */
    kHSP__XBAR_2_InputHspQdec3Dir   = 163|0x40000U, /**< HSP_QDEC3_DIR output assigned to HSP_XBAR_2_IN163 input. */
    kHSP__XBAR_2_InputHspQdec3CntUp = 164|0x40000U, /**< HSP_QDEC3_CNT_UP output assigned to HSP_XBAR_2_IN164 input. */
    kHSP__XBAR_2_InputHspQdec3CntDown = 165|0x40000U, /**< HSP_QDEC3_CNT_DOWN output assigned to HSP_XBAR_2_IN165 input. */
    kHSP__XBAR_2_InputHspSinc0PulseTrigOut0 = 166|0x40000U, /**< HSP_SINC0_PULSE_TRIG_OUT0 output assigned to HSP_XBAR_2_IN166 input. */
    kHSP__XBAR_2_InputHspSinc0PulseTrigOut1 = 167|0x40000U, /**< HSP_SINC0_PULSE_TRIG_OUT1 output assigned to HSP_XBAR_2_IN167 input. */
    kHSP__XBAR_2_InputHspSinc0PulseTrigOut2 = 168|0x40000U, /**< HSP_SINC0_PULSE_TRIG_OUT2 output assigned to HSP_XBAR_2_IN168 input. */
    kHSP__XBAR_2_InputHspSinc0PulseTrigOut3 = 169|0x40000U, /**< HSP_SINC0_PULSE_TRIG_OUT3 output assigned to HSP_XBAR_2_IN169 input. */
    kHSP__XBAR_2_InputHspSinc0FiltCc0 = 170|0x40000U, /**< HSP_SINC0_FILT_CC0 output assigned to HSP_XBAR_2_IN170 input. */
    kHSP__XBAR_2_InputHspSinc0FiltCc1 = 171|0x40000U, /**< HSP_SINC0_FILT_CC1 output assigned to HSP_XBAR_2_IN171 input. */
    kHSP__XBAR_2_InputHspSinc0FiltCc2 = 172|0x40000U, /**< HSP_SINC0_FILT_CC2 output assigned to HSP_XBAR_2_IN172 input. */
    kHSP__XBAR_2_InputHspSinc0FiltCc3 = 173|0x40000U, /**< HSP_SINC0_FILT_CC3 output assigned to HSP_XBAR_2_IN173 input. */
    kHSP__XBAR_2_InputHspSinc0ModOut2 = 174|0x40000U, /**< HSP_SINC0_MOD_OUT2 output assigned to HSP_XBAR_2_IN174 input. */
    kHSP__XBAR_2_InputHspSinc0Break0 = 175|0x40000U, /**< HSP_SINC0_BREAK0 output assigned to HSP_XBAR_2_IN175 input. */
    kHSP__XBAR_2_InputHspSinc0Break1 = 176|0x40000U, /**< HSP_SINC0_BREAK1 output assigned to HSP_XBAR_2_IN176 input. */
    kHSP__XBAR_2_InputHspSinc0Break2 = 177|0x40000U, /**< HSP_SINC0_BREAK2 output assigned to HSP_XBAR_2_IN177 input. */
    kHSP__XBAR_2_InputHspSinc0Break3 = 178|0x40000U, /**< HSP_SINC0_BREAK3 output assigned to HSP_XBAR_2_IN178 input. */
    kHSP__XBAR_2_InputHspSinc1PulseTrigOut0 = 179|0x40000U, /**< HSP_SINC1_PULSE_TRIG_OUT0 output assigned to HSP_XBAR_2_IN179 input. */
    kHSP__XBAR_2_InputHspSinc1PulseTrigOut1 = 180|0x40000U, /**< HSP_SINC1_PULSE_TRIG_OUT1 output assigned to HSP_XBAR_2_IN180 input. */
    kHSP__XBAR_2_InputHspSinc1PulseTrigOut2 = 181|0x40000U, /**< HSP_SINC1_PULSE_TRIG_OUT2 output assigned to HSP_XBAR_2_IN181 input. */
    kHSP__XBAR_2_InputHspSinc1PulseTrigOut3 = 182|0x40000U, /**< HSP_SINC1_PULSE_TRIG_OUT3 output assigned to HSP_XBAR_2_IN182 input. */
    kHSP__XBAR_2_InputHspSinc1FiltCc0 = 183|0x40000U, /**< HSP_SINC1_FILT_CC0 output assigned to HSP_XBAR_2_IN183 input. */
    kHSP__XBAR_2_InputHspSinc1FiltCc1 = 184|0x40000U, /**< HSP_SINC1_FILT_CC1 output assigned to HSP_XBAR_2_IN184 input. */
    kHSP__XBAR_2_InputHspSinc1FiltCc2 = 185|0x40000U, /**< HSP_SINC1_FILT_CC2 output assigned to HSP_XBAR_2_IN185 input. */
    kHSP__XBAR_2_InputHspSinc1FiltCc3 = 186|0x40000U, /**< HSP_SINC1_FILT_CC3 output assigned to HSP_XBAR_2_IN186 input. */
    kHSP__XBAR_2_InputHspSinc1ModOut2 = 187|0x40000U, /**< HSP_SINC1_MOD_OUT2 output assigned to HSP_XBAR_2_IN187 input. */
    kHSP__XBAR_2_InputHspSinc1Break0 = 188|0x40000U, /**< HSP_SINC1_BREAK0 output assigned to HSP_XBAR_2_IN188 input. */
    kHSP__XBAR_2_InputHspSinc1Break1 = 189|0x40000U, /**< HSP_SINC1_BREAK1 output assigned to HSP_XBAR_2_IN189 input. */
    kHSP__XBAR_2_InputHspSinc1Break2 = 190|0x40000U, /**< HSP_SINC1_BREAK2 output assigned to HSP_XBAR_2_IN190 input. */
    kHSP__XBAR_2_InputHspSinc1Break3 = 191|0x40000U, /**< HSP_SINC1_BREAK3 output assigned to HSP_XBAR_2_IN191 input. */
    kHSP__XBAR_2_InputHspFlexio0TrigOut0 = 192|0x40000U, /**< HSP_FLEXIO0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN192 input. */
    kHSP__XBAR_2_InputHspFlexio0TrigOut1 = 193|0x40000U, /**< HSP_FLEXIO0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN193 input. */
    kHSP__XBAR_2_InputHspFlexio0TrigOut2 = 194|0x40000U, /**< HSP_FLEXIO0_TRIG_OUT2 output assigned to HSP_XBAR_2_IN194 input. */
    kHSP__XBAR_2_InputHspFlexio0TrigOut3 = 195|0x40000U, /**< HSP_FLEXIO0_TRIG_OUT3 output assigned to HSP_XBAR_2_IN195 input. */
    kHSP__XBAR_2_InputHspFlexio1TrigOut0 = 196|0x40000U, /**< HSP_FLEXIO1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN196 input. */
    kHSP__XBAR_2_InputHspFlexio1TrigOut1 = 197|0x40000U, /**< HSP_FLEXIO1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN197 input. */
    kHSP__XBAR_2_InputHspFlexio1TrigOut2 = 198|0x40000U, /**< HSP_FLEXIO1_TRIG_OUT2 output assigned to HSP_XBAR_2_IN198 input. */
    kHSP__XBAR_2_InputHspFlexio1TrigOut3 = 199|0x40000U, /**< HSP_FLEXIO1_TRIG_OUT3 output assigned to HSP_XBAR_2_IN199 input. */
    kHSP__XBAR_2_InputHspFlexio2TrigOut0 = 200|0x40000U, /**< HSP_FLEXIO2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN200 input. */
    kHSP__XBAR_2_InputHspFlexio2TrigOut1 = 201|0x40000U, /**< HSP_FLEXIO2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN201 input. */
    kHSP__XBAR_2_InputHspFlexio2TrigOut2 = 202|0x40000U, /**< HSP_FLEXIO2_TRIG_OUT2 output assigned to HSP_XBAR_2_IN202 input. */
    kHSP__XBAR_2_InputHspFlexio2TrigOut3 = 203|0x40000U, /**< HSP_FLEXIO2_TRIG_OUT3 output assigned to HSP_XBAR_2_IN203 input. */
    kHSP__XBAR_2_InputHspLpi2c0TrigOut = 204|0x40000U, /**< HSP_LPI2C0_TRIG_OUT output assigned to HSP_XBAR_2_IN204 input. */
    kHSP__XBAR_2_InputHspLpi2c0MstBusy = 205|0x40000U, /**< HSP_LPI2C0_MST_BUSY output assigned to HSP_XBAR_2_IN205 input. */
    kHSP__XBAR_2_InputHspLpi2c0BusBusy = 206|0x40000U, /**< HSP_LPI2C0_BUS_BUSY output assigned to HSP_XBAR_2_IN206 input. */
    kHSP__XBAR_2_InputHspLpi2c1TrigOut = 207|0x40000U, /**< HSP_LPI2C1_TRIG_OUT output assigned to HSP_XBAR_2_IN207 input. */
    kHSP__XBAR_2_InputHspLpi2c1MstBusy = 208|0x40000U, /**< HSP_LPI2C1_MST_BUSY output assigned to HSP_XBAR_2_IN208 input. */
    kHSP__XBAR_2_InputHspLpi2c1BusBusy = 209|0x40000U, /**< HSP_LPI2C1_BUS_BUSY output assigned to HSP_XBAR_2_IN209 input. */
    kHSP__XBAR_2_InputRESERVED210   = 210|0x40000U, /**< HSP_XBAR_2_IN210 input is reserved. */
    kHSP__XBAR_2_InputRESERVED211   = 211|0x40000U, /**< HSP_XBAR_2_IN211 input is reserved. */
    kHSP__XBAR_2_InputRESERVED212   = 212|0x40000U, /**< HSP_XBAR_2_IN212 input is reserved. */
    kHSP__XBAR_2_InputRESERVED213   = 213|0x40000U, /**< HSP_XBAR_2_IN213 input is reserved. */
    kHSP__XBAR_2_InputRESERVED214   = 214|0x40000U, /**< HSP_XBAR_2_IN214 input is reserved. */
    kHSP__XBAR_2_InputRESERVED215   = 215|0x40000U, /**< HSP_XBAR_2_IN215 input is reserved. */
    kHSP__XBAR_2_InputHspLpspi0EndOfFrame = 216|0x40000U, /**< HSP_LPSPI0_END_OF_FRAME output assigned to HSP_XBAR_2_IN216 input. */
    kHSP__XBAR_2_InputHspLpspi0EndOfWord = 217|0x40000U, /**< HSP_LPSPI0_END_OF_WORD output assigned to HSP_XBAR_2_IN217 input. */
    kHSP__XBAR_2_InputHspLpspi1EndOfFrame = 218|0x40000U, /**< HSP_LPSPI1_END_OF_FRAME output assigned to HSP_XBAR_2_IN218 input. */
    kHSP__XBAR_2_InputHspLpspi1EndOfWord = 219|0x40000U, /**< HSP_LPSPI1_END_OF_WORD output assigned to HSP_XBAR_2_IN219 input. */
    kHSP__XBAR_2_InputHspLpspi2EndOfFrame = 220|0x40000U, /**< HSP_LPSPI2_END_OF_FRAME output assigned to HSP_XBAR_2_IN220 input. */
    kHSP__XBAR_2_InputHspLpspi2EndOfWord = 221|0x40000U, /**< HSP_LPSPI2_END_OF_WORD output assigned to HSP_XBAR_2_IN221 input. */
    kHSP__XBAR_2_InputHspLpspi3EndOfFrame = 222|0x40000U, /**< HSP_LPSPI3_END_OF_FRAME output assigned to HSP_XBAR_2_IN222 input. */
    kHSP__XBAR_2_InputHspLpspi3EndOfWord = 223|0x40000U, /**< HSP_LPSPI3_END_OF_WORD output assigned to HSP_XBAR_2_IN223 input. */
    kHSP__XBAR_2_InputHspLpspi4EndOfFrame = 224|0x40000U, /**< HSP_LPSPI4_END_OF_FRAME output assigned to HSP_XBAR_2_IN224 input. */
    kHSP__XBAR_2_InputHspLpspi4EndOfWord = 225|0x40000U, /**< HSP_LPSPI4_END_OF_WORD output assigned to HSP_XBAR_2_IN225 input. */
    kHSP__XBAR_2_InputHspLpuart0TxEndOfWord = 226|0x40000U, /**< HSP_LPUART0_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN226 input. */
    kHSP__XBAR_2_InputHspLpuart0RxEndOfWord = 227|0x40000U, /**< HSP_LPUART0_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN227 input. */
    kHSP__XBAR_2_InputHspLpuart0RxIdle = 228|0x40000U, /**< HSP_LPUART0_RX_IDLE output assigned to HSP_XBAR_2_IN228 input. */
    kHSP__XBAR_2_InputHspLpuart0TxData = 229|0x40000U, /**< HSP_LPUART0_TX_DATA output assigned to HSP_XBAR_2_IN229 input. */
    kHSP__XBAR_2_InputHspLpuart1TxEndOfWord = 230|0x40000U, /**< HSP_LPUART1_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN230 input. */
    kHSP__XBAR_2_InputHspLpuart1RxEndOfWord = 231|0x40000U, /**< HSP_LPUART1_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN231 input. */
    kHSP__XBAR_2_InputHspLpuart1RxIdle = 232|0x40000U, /**< HSP_LPUART1_RX_IDLE output assigned to HSP_XBAR_2_IN232 input. */
    kHSP__XBAR_2_InputHspLpuart1TxData = 233|0x40000U, /**< HSP_LPUART1_TX_DATA output assigned to HSP_XBAR_2_IN233 input. */
    kHSP__XBAR_2_InputHspLpuart2TxEndOfWord = 234|0x40000U, /**< HSP_LPUART2_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN234 input. */
    kHSP__XBAR_2_InputHspLpuart2RxEndOfWord = 235|0x40000U, /**< HSP_LPUART2_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN235 input. */
    kHSP__XBAR_2_InputHspLpuart2RxIdle = 236|0x40000U, /**< HSP_LPUART2_RX_IDLE output assigned to HSP_XBAR_2_IN236 input. */
    kHSP__XBAR_2_InputHspLpuart2TxData = 237|0x40000U, /**< HSP_LPUART2_TX_DATA output assigned to HSP_XBAR_2_IN237 input. */
    kHSP__XBAR_2_InputHspLpuart3TxEndOfWord = 238|0x40000U, /**< HSP_LPUART3_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN238 input. */
    kHSP__XBAR_2_InputHspLpuart3RxEndOfWord = 239|0x40000U, /**< HSP_LPUART3_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN239 input. */
    kHSP__XBAR_2_InputHspLpuart3RxIdle = 240|0x40000U, /**< HSP_LPUART3_RX_IDLE output assigned to HSP_XBAR_2_IN240 input. */
    kHSP__XBAR_2_InputHspLpuart3TxData = 241|0x40000U, /**< HSP_LPUART3_TX_DATA output assigned to HSP_XBAR_2_IN241 input. */
    kHSP__XBAR_2_InputHspLpuart4TxEndOfWord = 242|0x40000U, /**< HSP_LPUART4_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN242 input. */
    kHSP__XBAR_2_InputHspLpuart4RxEndOfWord = 243|0x40000U, /**< HSP_LPUART4_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN243 input. */
    kHSP__XBAR_2_InputHspLpuart4RxIdle = 244|0x40000U, /**< HSP_LPUART4_RX_IDLE output assigned to HSP_XBAR_2_IN244 input. */
    kHSP__XBAR_2_InputHspLpuart4TxData = 245|0x40000U, /**< HSP_LPUART4_TX_DATA output assigned to HSP_XBAR_2_IN245 input. */
    kHSP__XBAR_2_InputHspLpuart5TxEndOfWord = 246|0x40000U, /**< HSP_LPUART5_TX_END_OF_WORD output assigned to HSP_XBAR_2_IN246 input. */
    kHSP__XBAR_2_InputHspLpuart5RxEndOfWord = 247|0x40000U, /**< HSP_LPUART5_RX_END_OF_WORD output assigned to HSP_XBAR_2_IN247 input. */
    kHSP__XBAR_2_InputHspLpuart5RxIdle = 248|0x40000U, /**< HSP_LPUART5_RX_IDLE output assigned to HSP_XBAR_2_IN248 input. */
    kHSP__XBAR_2_InputHspLpuart5TxData = 249|0x40000U, /**< HSP_LPUART5_TX_DATA output assigned to HSP_XBAR_2_IN249 input. */
    kHSP__XBAR_2_InputHspGpio0TrigOut0 = 250|0x40000U, /**< HSP_GPIO0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN250 input. */
    kHSP__XBAR_2_InputHspGpio0TrigOut1 = 251|0x40000U, /**< HSP_GPIO0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN251 input. */
    kHSP__XBAR_2_InputHspGpio1TrigOut0 = 252|0x40000U, /**< HSP_GPIO1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN252 input. */
    kHSP__XBAR_2_InputHspGpio1TrigOut1 = 253|0x40000U, /**< HSP_GPIO1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN253 input. */
    kHSP__XBAR_2_InputHspGpio2TrigOut0 = 254|0x40000U, /**< HSP_GPIO2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN254 input. */
    kHSP__XBAR_2_InputHspGpio2TrigOut1 = 255|0x40000U, /**< HSP_GPIO2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN255 input. */
    kHSP__XBAR_2_InputHspGpio3TrigOut0 = 256|0x40000U, /**< HSP_GPIO3_TRIG_OUT0 output assigned to HSP_XBAR_2_IN256 input. */
    kHSP__XBAR_2_InputHspGpio3TrigOut1 = 257|0x40000U, /**< HSP_GPIO3_TRIG_OUT1 output assigned to HSP_XBAR_2_IN257 input. */
    kHSP__XBAR_2_InputHspGpio4TrigOut0 = 258|0x40000U, /**< HSP_GPIO4_TRIG_OUT0 output assigned to HSP_XBAR_2_IN258 input. */
    kHSP__XBAR_2_InputHspGpio4TrigOut1 = 259|0x40000U, /**< HSP_GPIO4_TRIG_OUT1 output assigned to HSP_XBAR_2_IN259 input. */
    kHSP__XBAR_2_InputRESERVED260   = 260|0x40000U, /**< HSP_XBAR_2_IN260 input is reserved. */
    kHSP__XBAR_2_InputRESERVED261   = 261|0x40000U, /**< HSP_XBAR_2_IN261 input is reserved. */
    kHSP__XBAR_2_InputRESERVED262   = 262|0x40000U, /**< HSP_XBAR_2_IN262 input is reserved. */
    kHSP__XBAR_2_InputRESERVED263   = 263|0x40000U, /**< HSP_XBAR_2_IN263 input is reserved. */
    kHSP__XBAR_2_InputCommUsb0Sof   = 264|0x40000U, /**< COMM_USB0_SOF output assigned to HSP_XBAR_2_IN264 input. */
    kHSP__XBAR_2_InputCommUsb1Sof   = 265|0x40000U, /**< COMM_USB1_SOF output assigned to HSP_XBAR_2_IN265 input. */
    kHSP__XBAR_2_InputCommEnet0PpsCh0 = 266|0x40000U, /**< COMM_ENET0_PPS_CH0 output assigned to HSP_XBAR_2_IN266 input. */
    kHSP__XBAR_2_InputCommEnet0PpsCh1 = 267|0x40000U, /**< COMM_ENET0_PPS_CH1 output assigned to HSP_XBAR_2_IN267 input. */
    kHSP__XBAR_2_InputCommEnet0PpsCh2 = 268|0x40000U, /**< COMM_ENET0_PPS_CH2 output assigned to HSP_XBAR_2_IN268 input. */
    kHSP__XBAR_2_InputCommEnet0PpsCh3 = 269|0x40000U, /**< COMM_ENET0_PPS_CH3 output assigned to HSP_XBAR_2_IN269 input. */
    kHSP__XBAR_2_InputCommEth1Ieee1588TimerOut0 = 270|0x40000U, /**< COMM_ETH1_IEEE_1588_TIMER_OUT0 output assigned to HSP_XBAR_2_IN270 input. */
    kHSP__XBAR_2_InputCommEth1Ieee1588TimerOut1 = 271|0x40000U, /**< COMM_ETH1_IEEE_1588_TIMER_OUT1 output assigned to HSP_XBAR_2_IN271 input. */
    kHSP__XBAR_2_InputCommEth1Ieee1588TimerOut2 = 272|0x40000U, /**< COMM_ETH1_IEEE_1588_TIMER_OUT2 output assigned to HSP_XBAR_2_IN272 input. */
    kHSP__XBAR_2_InputCommEth1Ieee1588TimerOut3 = 273|0x40000U, /**< COMM_ETH1_IEEE_1588_TIMER_OUT3 output assigned to HSP_XBAR_2_IN273 input. */
    kHSP__XBAR_2_InputRESERVED274   = 274|0x40000U, /**< HSP_XBAR_2_IN274 input is reserved. */
    kHSP__XBAR_2_InputCommXenophy0TxFrame = 275|0x40000U, /**< COMM_XENOPHY0_TX_FRAME output assigned to HSP_XBAR_2_IN275 input. */
    kHSP__XBAR_2_InputCommXenophy0RxFrame = 276|0x40000U, /**< COMM_XENOPHY0_RX_FRAME output assigned to HSP_XBAR_2_IN276 input. */
    kHSP__XBAR_2_InputCommXenophy1TxFrame = 277|0x40000U, /**< COMM_XENOPHY1_TX_FRAME output assigned to HSP_XBAR_2_IN277 input. */
    kHSP__XBAR_2_InputCommXenophy1RxFrame = 278|0x40000U, /**< COMM_XENOPHY1_RX_FRAME output assigned to HSP_XBAR_2_IN278 input. */
    kHSP__XBAR_2_InputCmptCm85Txev  = 279|0x40000U, /**< CMPT_CM85_TXEV output assigned to HSP_XBAR_2_IN279 input. */
    kHSP__XBAR_2_InputRESERVED280   = 280|0x40000U, /**< HSP_XBAR_2_IN280 input is reserved. */
    kHSP__XBAR_2_InputRESERVED281   = 281|0x40000U, /**< HSP_XBAR_2_IN281 input is reserved. */
    kHSP__XBAR_2_InputRESERVED282   = 282|0x40000U, /**< HSP_XBAR_2_IN282 input is reserved. */
    kWAKE__XBAR_InputLogicLow       = 0|0x50000U,  /**< LOGIC_LOW output assigned to WAKE_XBAR_IN0 input. */
    kWAKE__XBAR_InputLogicHigh      = 1|0x50000U,  /**< LOGIC_HIGH output assigned to WAKE_XBAR_IN1 input. */
    kWAKE__XBAR_InputWakeEdmaTrigOut0 = 2|0x50000U, /**< WAKE_EDMA_TRIG_OUT0 output assigned to WAKE_XBAR_IN2 input. */
    kWAKE__XBAR_InputWakeEdmaIdle   = 3|0x50000U,  /**< WAKE_EDMA_IDLE output assigned to WAKE_XBAR_IN3 input. */
    kWAKE__XBAR_InputWakeAcmp0Cout  = 4|0x50000U,  /**< WAKE_ACMP0_COUT output assigned to WAKE_XBAR_IN4 input. */
    kWAKE__XBAR_InputWakeAcmp1Cout  = 5|0x50000U,  /**< WAKE_ACMP1_COUT output assigned to WAKE_XBAR_IN5 input. */
    kWAKE__XBAR_InputWakeAcmp2Cout  = 6|0x50000U,  /**< WAKE_ACMP2_COUT output assigned to WAKE_XBAR_IN6 input. */
    kWAKE__XBAR_InputWakeAcmp3Cout  = 7|0x50000U,  /**< WAKE_ACMP3_COUT output assigned to WAKE_XBAR_IN7 input. */
    kWAKE__XBAR_InputWakeLptmr0TrigOut = 8|0x50000U, /**< WAKE_LPTMR0_TRIG_OUT output assigned to WAKE_XBAR_IN8 input. */
    kWAKE__XBAR_InputWakeLptmr1TrigOut = 9|0x50000U, /**< WAKE_LPTMR1_TRIG_OUT output assigned to WAKE_XBAR_IN9 input. */
