zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/MIMXRT2661_COMMON.h
    kWAKE__XBAR_InputWakeQuadtpmCntTrigOut0 = 10|0x50000U, /**< WAKE_QUADTPM_CNT_TRIG_OUT0 output assigned to WAKE_XBAR_IN10 input. */
    kWAKE__XBAR_InputWakeQuadtpmCntTrigOut1 = 11|0x50000U, /**< WAKE_QUADTPM_CNT_TRIG_OUT1 output assigned to WAKE_XBAR_IN11 input. */
    kWAKE__XBAR_InputWakeQuadtpmCntTrigOut2 = 12|0x50000U, /**< WAKE_QUADTPM_CNT_TRIG_OUT2 output assigned to WAKE_XBAR_IN12 input. */
    kWAKE__XBAR_InputWakeQuadtpmCntTrigOut3 = 13|0x50000U, /**< WAKE_QUADTPM_CNT_TRIG_OUT3 output assigned to WAKE_XBAR_IN13 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut0 = 14|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT0 output assigned to WAKE_XBAR_IN14 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut1 = 15|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT1 output assigned to WAKE_XBAR_IN15 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut2 = 16|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT2 output assigned to WAKE_XBAR_IN16 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut3 = 17|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT3 output assigned to WAKE_XBAR_IN17 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut4 = 18|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT4 output assigned to WAKE_XBAR_IN18 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut5 = 19|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT5 output assigned to WAKE_XBAR_IN19 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut6 = 20|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT6 output assigned to WAKE_XBAR_IN20 input. */
    kWAKE__XBAR_InputWakeQuadtpmChTrigOut7 = 21|0x50000U, /**< WAKE_QUADTPM_CH_TRIG_OUT7 output assigned to WAKE_XBAR_IN21 input. */
    kWAKE__XBAR_InputWakeLpi2c0TrigOut = 22|0x50000U, /**< WAKE_LPI2C0_TRIG_OUT output assigned to WAKE_XBAR_IN22 input. */
    kWAKE__XBAR_InputWakeLpi2c0MstBusy = 23|0x50000U, /**< WAKE_LPI2C0_MST_BUSY output assigned to WAKE_XBAR_IN23 input. */
    kWAKE__XBAR_InputWakeLpi2c0BusBusy = 24|0x50000U, /**< WAKE_LPI2C0_BUS_BUSY output assigned to WAKE_XBAR_IN24 input. */
    kWAKE__XBAR_InputWakeLpi2c1TrigOut = 25|0x50000U, /**< WAKE_LPI2C1_TRIG_OUT output assigned to WAKE_XBAR_IN25 input. */
    kWAKE__XBAR_InputWakeLpi2c1MstBusy = 26|0x50000U, /**< WAKE_LPI2C1_MST_BUSY output assigned to WAKE_XBAR_IN26 input. */
    kWAKE__XBAR_InputWakeLpi2c1BusBusy = 27|0x50000U, /**< WAKE_LPI2C1_BUS_BUSY output assigned to WAKE_XBAR_IN27 input. */
    kWAKE__XBAR_InputWakeLpspiEndOfFrame = 28|0x50000U, /**< WAKE_LPSPI_END_OF_FRAME output assigned to WAKE_XBAR_IN28 input. */
    kWAKE__XBAR_InputWakeLpspiEndOfWord = 29|0x50000U, /**< WAKE_LPSPI_END_OF_WORD output assigned to WAKE_XBAR_IN29 input. */
    kWAKE__XBAR_InputWakeLpuart0TxEndOfWord = 30|0x50000U, /**< WAKE_LPUART0_TX_END_OF_WORD output assigned to WAKE_XBAR_IN30 input. */
    kWAKE__XBAR_InputWakeLpuart0RxEndOfWord = 31|0x50000U, /**< WAKE_LPUART0_RX_END_OF_WORD output assigned to WAKE_XBAR_IN31 input. */
    kWAKE__XBAR_InputWakeLpuart0RxIdle = 32|0x50000U, /**< WAKE_LPUART0_RX_IDLE output assigned to WAKE_XBAR_IN32 input. */
    kWAKE__XBAR_InputWakeLpuart0TxData = 33|0x50000U, /**< WAKE_LPUART0_TX_DATA output assigned to WAKE_XBAR_IN33 input. */
    kWAKE__XBAR_InputWakeLpuart1TxEndOfWord = 34|0x50000U, /**< WAKE_LPUART1_TX_END_OF_WORD output assigned to WAKE_XBAR_IN34 input. */
    kWAKE__XBAR_InputWakeLpuart1RxEndOfWord = 35|0x50000U, /**< WAKE_LPUART1_RX_END_OF_WORD output assigned to WAKE_XBAR_IN35 input. */
    kWAKE__XBAR_InputWakeLpuart1RxIdle = 36|0x50000U, /**< WAKE_LPUART1_RX_IDLE output assigned to WAKE_XBAR_IN36 input. */
    kWAKE__XBAR_InputWakeLpuart1TxData = 37|0x50000U, /**< WAKE_LPUART1_TX_DATA output assigned to WAKE_XBAR_IN37 input. */
    kWAKE__XBAR_InputWakeMicfilMicFilter = 38|0x50000U, /**< WAKE_MICFIL_MIC_FILTER output assigned to WAKE_XBAR_IN38 input. */
    kWAKE__XBAR_InputWakeMicfilHwvadEvert = 39|0x50000U, /**< WAKE_MICFIL_HWVAD_EVERT output assigned to WAKE_XBAR_IN39 input. */
    kWAKE__XBAR_InputWakeGpioTrigOut0 = 40|0x50000U, /**< WAKE_GPIO_TRIG_OUT0 output assigned to WAKE_XBAR_IN40 input. */
    kWAKE__XBAR_InputWakeGpioTrigOut1 = 41|0x50000U, /**< WAKE_GPIO_TRIG_OUT1 output assigned to WAKE_XBAR_IN41 input. */
    kWAKE__XBAR_InputVbatTdetTemperOut = 42|0x50000U, /**< VBAT_TDET_TEMPER_OUT output assigned to WAKE_XBAR_IN42 input. */
    kWAKE__XBAR_InputVbatLptmrTrigOut = 43|0x50000U, /**< VBAT_LPTMR_TRIG_OUT output assigned to WAKE_XBAR_IN43 input. */
    kWAKE__XBAR_InputVbatRtcCalOut  = 44|0x50000U, /**< VBAT_RTC_CAL_OUT output assigned to WAKE_XBAR_IN44 input. */
    kWAKE__XBAR_InputVbatRtcAlarm   = 45|0x50000U, /**< VBAT_RTC_ALARM output assigned to WAKE_XBAR_IN45 input. */
    kWAKE__XBAR_InputVbatRtcClkOut  = 46|0x50000U, /**< VBAT_RTC_CLK_OUT output assigned to WAKE_XBAR_IN46 input. */
    kWAKE__XBAR_InputVbatGpioTrigOut0 = 47|0x50000U, /**< VBAT_GPIO_TRIG_OUT0 output assigned to WAKE_XBAR_IN47 input. */
    kWAKE__XBAR_InputVbatGpioTrigOut1 = 48|0x50000U, /**< VBAT_GPIO_TRIG_OUT1 output assigned to WAKE_XBAR_IN48 input. */
    kWAKE__XBAR_InputRESERVED49     = 49|0x50000U, /**< WAKE_XBAR_IN49 input is reserved. */
    kWAKE__XBAR_InputRESERVED50     = 50|0x50000U, /**< WAKE_XBAR_IN50 input is reserved. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut0 = 51|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT0 output assigned to WAKE_XBAR_IN51 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut1 = 52|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT1 output assigned to WAKE_XBAR_IN52 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut2 = 53|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT2 output assigned to WAKE_XBAR_IN53 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut3 = 54|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT3 output assigned to WAKE_XBAR_IN54 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut4 = 55|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT4 output assigned to WAKE_XBAR_IN55 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut5 = 56|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT5 output assigned to WAKE_XBAR_IN56 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut6 = 57|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT6 output assigned to WAKE_XBAR_IN57 input. */
    kWAKE__XBAR_InputHspTrgsync0SyncOut7 = 58|0x50000U, /**< HSP_TRGSYNC0_SYNC_OUT7 output assigned to WAKE_XBAR_IN58 input. */
    kWAKE__XBAR_InputWakeXbarIn0    = 59|0x50000U, /**< WAKE_XBAR_IN0 output assigned to WAKE_XBAR_IN59 input. */
    kWAKE__XBAR_InputWakeXbarIn1    = 60|0x50000U, /**< WAKE_XBAR_IN1 output assigned to WAKE_XBAR_IN60 input. */
    kWAKE__XBAR_InputWakeXbarIn2    = 61|0x50000U, /**< WAKE_XBAR_IN2 output assigned to WAKE_XBAR_IN61 input. */
    kWAKE__XBAR_InputWakeXbarIn3    = 62|0x50000U, /**< WAKE_XBAR_IN3 output assigned to WAKE_XBAR_IN62 input. */
    kWAKE__XBAR_InputWakeXbarIn4    = 63|0x50000U, /**< WAKE_XBAR_IN4 output assigned to WAKE_XBAR_IN63 input. */
    kWAKE__XBAR_InputWakeXbarIn5    = 64|0x50000U, /**< WAKE_XBAR_IN5 output assigned to WAKE_XBAR_IN64 input. */
    kWAKE__XBAR_InputWakeXbarIn6    = 65|0x50000U, /**< WAKE_XBAR_IN6 output assigned to WAKE_XBAR_IN65 input. */
    kWAKE__XBAR_InputWakeXbarIn7    = 66|0x50000U, /**< WAKE_XBAR_IN7 output assigned to WAKE_XBAR_IN66 input. */
    kWAKE__XBAR_InputWakeTrgsyncSyncOut0 = 67|0x50000U, /**< WAKE_TRGSYNC_SYNC_OUT0 output assigned to WAKE_XBAR_IN67 input. */
    kWAKE__XBAR_InputWakeTrgsyncSyncOut1 = 68|0x50000U, /**< WAKE_TRGSYNC_SYNC_OUT1 output assigned to WAKE_XBAR_IN68 input. */
    kWAKE__XBAR_InputWakeTrgsyncSyncOut2 = 69|0x50000U, /**< WAKE_TRGSYNC_SYNC_OUT2 output assigned to WAKE_XBAR_IN69 input. */
    kWAKE__XBAR_InputWakeTrgsyncSyncOut3 = 70|0x50000U, /**< WAKE_TRGSYNC_SYNC_OUT3 output assigned to WAKE_XBAR_IN70 input. */
} xbar_input_signal_t;

