zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/MIMXRT2661_COMMON.h
/* DMA5 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE                         (0x50300000u)
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE_NS                      (0x40300000u)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5                              ((DMA5_Type *)MAIN__EDMA5_BASE)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5_NS                           ((DMA5_Type *)MAIN__EDMA5_BASE_NS)
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS                          { MAIN__EDMA5_BASE }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS                           { MAIN__EDMA5 }
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS_NS                       { MAIN__EDMA5_BASE_NS }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS_NS                        { MAIN__EDMA5_NS }
#else
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE                         (0x40300000u)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5                              ((DMA5_Type *)MAIN__EDMA5_BASE)
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS                          { MAIN__EDMA5_BASE }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS                           { MAIN__EDMA5 }
#endif
/** Interrupt vectors for the DMA5 peripheral type */
#define DMA5_IRQS                                { { MAIN_EDMA5_CH0_IRQn, MAIN_EDMA5_CH1_IRQn, MAIN_EDMA5_CH2_IRQn, MAIN_EDMA5_CH3_IRQn, MAIN_EDMA5_CH4_IRQn, MAIN_EDMA5_CH5_IRQn, MAIN_EDMA5_CH6_IRQn, MAIN_EDMA5_CH7_IRQn, MAIN_EDMA5_CH8_IRQn, MAIN_EDMA5_CH9_IRQn, MAIN_EDMA5_CH10_IRQn, MAIN_EDMA5_CH11_IRQn, MAIN_EDMA5_CH12_IRQn, MAIN_EDMA5_CH13_IRQn, MAIN_EDMA5_CH14_IRQn, MAIN_EDMA5_CH15_IRQn } }

/* ENET - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__ENET base address */
  #define COMM__ENET_BASE                          (0x5A0D0000u)
  /** Peripheral COMM__ENET base address */
  #define COMM__ENET_BASE_NS                       (0x4A0D0000u)
  /** Peripheral COMM__ENET base pointer */
  #define COMM__ENET                               ((ENET_Type *)COMM__ENET_BASE)
  /** Peripheral COMM__ENET base pointer */
  #define COMM__ENET_NS                            ((ENET_Type *)COMM__ENET_BASE_NS)
  /** Array initializer of ENET peripheral base addresses */
  #define ENET_BASE_ADDRS                          { COMM__ENET_BASE }
  /** Array initializer of ENET peripheral base pointers */
  #define ENET_BASE_PTRS                           { COMM__ENET }
  /** Array initializer of ENET peripheral base addresses */
  #define ENET_BASE_ADDRS_NS                       { COMM__ENET_BASE_NS }
  /** Array initializer of ENET peripheral base pointers */
  #define ENET_BASE_PTRS_NS                        { COMM__ENET_NS }
#else
  /** Peripheral COMM__ENET base address */
  #define COMM__ENET_BASE                          (0x4A0D0000u)
  /** Peripheral COMM__ENET base pointer */
  #define COMM__ENET                               ((ENET_Type *)COMM__ENET_BASE)
  /** Array initializer of ENET peripheral base addresses */
  #define ENET_BASE_ADDRS                          { COMM__ENET_BASE }
  /** Array initializer of ENET peripheral base pointers */
  #define ENET_BASE_PTRS                           { COMM__ENET }
#endif
/** Interrupt vectors for the ENET peripheral type */
#define ENET_Transmit_IRQS                       { COMM_ENET_TX_IRQn }
#define ENET_Receive_IRQS                        { COMM_ENET_RX_IRQn }
#define ENET_Error_IRQS                          { COMM_ENET_OTHER_IRQn }
#define ENET_1588_Timer_IRQS                     { COMM_ENET_1588_IRQn }
#define ENET_Ts_IRQS                             { COMM_ENET_TX_IRQn }
/* ENET Buffer Descriptor and Buffer Address Alignment. */
#define ENET_BUFF_ALIGNMENT                      (64U)


/* ENET_QOS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__ENET_QOS base address */
  #define COMM__ENET_QOS_BASE                      (0x5A0C0000u)
  /** Peripheral COMM__ENET_QOS base address */
  #define COMM__ENET_QOS_BASE_NS                   (0x4A0C0000u)
  /** Peripheral COMM__ENET_QOS base pointer */
  #define COMM__ENET_QOS                           ((ENET_QOS_Type *)COMM__ENET_QOS_BASE)
  /** Peripheral COMM__ENET_QOS base pointer */
  #define COMM__ENET_QOS_NS                        ((ENET_QOS_Type *)COMM__ENET_QOS_BASE_NS)
  /** Array initializer of ENET_QOS peripheral base addresses */
  #define ENET_QOS_BASE_ADDRS                      { COMM__ENET_QOS_BASE }
  /** Array initializer of ENET_QOS peripheral base pointers */
  #define ENET_QOS_BASE_PTRS                       { COMM__ENET_QOS }
  /** Array initializer of ENET_QOS peripheral base addresses */
  #define ENET_QOS_BASE_ADDRS_NS                   { COMM__ENET_QOS_BASE_NS }
  /** Array initializer of ENET_QOS peripheral base pointers */
  #define ENET_QOS_BASE_PTRS_NS                    { COMM__ENET_QOS_NS }
#else
  /** Peripheral COMM__ENET_QOS base address */
  #define COMM__ENET_QOS_BASE                      (0x4A0C0000u)
  /** Peripheral COMM__ENET_QOS base pointer */
  #define COMM__ENET_QOS                           ((ENET_QOS_Type *)COMM__ENET_QOS_BASE)
  /** Array initializer of ENET_QOS peripheral base addresses */
  #define ENET_QOS_BASE_ADDRS                      { COMM__ENET_QOS_BASE }
  /** Array initializer of ENET_QOS peripheral base pointers */
  #define ENET_QOS_BASE_PTRS                       { COMM__ENET_QOS }
#endif
/** Interrupt vectors for the ENET_QOS peripheral type */
#define ENET_QOS_IRQS                            { COMM_ENET_QOS_IRQn }

/* EQDC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__EQDC_0 base address */
  #define HSP__EQDC_0_BASE                         (0x520C0000u)
  /** Peripheral HSP__EQDC_0 base address */
  #define HSP__EQDC_0_BASE_NS                      (0x420C0000u)
  /** Peripheral HSP__EQDC_0 base pointer */
  #define HSP__EQDC_0                              ((EQDC_Type *)HSP__EQDC_0_BASE)
  /** Peripheral HSP__EQDC_0 base pointer */
  #define HSP__EQDC_0_NS                           ((EQDC_Type *)HSP__EQDC_0_BASE_NS)
  /** Peripheral HSP__EQDC_1 base address */
  #define HSP__EQDC_1_BASE                         (0x520D0000u)
  /** Peripheral HSP__EQDC_1 base address */
  #define HSP__EQDC_1_BASE_NS                      (0x420D0000u)
  /** Peripheral HSP__EQDC_1 base pointer */
  #define HSP__EQDC_1                              ((EQDC_Type *)HSP__EQDC_1_BASE)
  /** Peripheral HSP__EQDC_1 base pointer */
  #define HSP__EQDC_1_NS                           ((EQDC_Type *)HSP__EQDC_1_BASE_NS)
  /** Peripheral HSP__EQDC_2 base address */
  #define HSP__EQDC_2_BASE                         (0x528C0000u)
  /** Peripheral HSP__EQDC_2 base address */
  #define HSP__EQDC_2_BASE_NS                      (0x428C0000u)
  /** Peripheral HSP__EQDC_2 base pointer */
  #define HSP__EQDC_2                              ((EQDC_Type *)HSP__EQDC_2_BASE)
  /** Peripheral HSP__EQDC_2 base pointer */
  #define HSP__EQDC_2_NS                           ((EQDC_Type *)HSP__EQDC_2_BASE_NS)
  /** Peripheral HSP__EQDC_3 base address */
  #define HSP__EQDC_3_BASE                         (0x528D0000u)
  /** Peripheral HSP__EQDC_3 base address */
  #define HSP__EQDC_3_BASE_NS                      (0x428D0000u)
  /** Peripheral HSP__EQDC_3 base pointer */
  #define HSP__EQDC_3                              ((EQDC_Type *)HSP__EQDC_3_BASE)
  /** Peripheral HSP__EQDC_3 base pointer */
  #define HSP__EQDC_3_NS                           ((EQDC_Type *)HSP__EQDC_3_BASE_NS)
  /** Array initializer of EQDC peripheral base addresses */
  #define EQDC_BASE_ADDRS                          { HSP__EQDC_0_BASE, HSP__EQDC_1_BASE, HSP__EQDC_2_BASE, HSP__EQDC_3_BASE }
  /** Array initializer of EQDC peripheral base pointers */
  #define EQDC_BASE_PTRS                           { HSP__EQDC_0, HSP__EQDC_1, HSP__EQDC_2, HSP__EQDC_3 }
  /** Array initializer of EQDC peripheral base addresses */
  #define EQDC_BASE_ADDRS_NS                       { HSP__EQDC_0_BASE_NS, HSP__EQDC_1_BASE_NS, HSP__EQDC_2_BASE_NS, HSP__EQDC_3_BASE_NS }
  /** Array initializer of EQDC peripheral base pointers */
  #define EQDC_BASE_PTRS_NS                        { HSP__EQDC_0_NS, HSP__EQDC_1_NS, HSP__EQDC_2_NS, HSP__EQDC_3_NS }
#else
  /** Peripheral HSP__EQDC_0 base address */
  #define HSP__EQDC_0_BASE                         (0x420C0000u)
  /** Peripheral HSP__EQDC_0 base pointer */
  #define HSP__EQDC_0                              ((EQDC_Type *)HSP__EQDC_0_BASE)
  /** Peripheral HSP__EQDC_1 base address */
  #define HSP__EQDC_1_BASE                         (0x420D0000u)
  /** Peripheral HSP__EQDC_1 base pointer */
  #define HSP__EQDC_1                              ((EQDC_Type *)HSP__EQDC_1_BASE)
  /** Peripheral HSP__EQDC_2 base address */
  #define HSP__EQDC_2_BASE                         (0x428C0000u)
  /** Peripheral HSP__EQDC_2 base pointer */
  #define HSP__EQDC_2                              ((EQDC_Type *)HSP__EQDC_2_BASE)
  /** Peripheral HSP__EQDC_3 base address */
  #define HSP__EQDC_3_BASE                         (0x428D0000u)
  /** Peripheral HSP__EQDC_3 base pointer */
  #define HSP__EQDC_3                              ((EQDC_Type *)HSP__EQDC_3_BASE)
  /** Array initializer of EQDC peripheral base addresses */
  #define EQDC_BASE_ADDRS                          { HSP__EQDC_0_BASE, HSP__EQDC_1_BASE, HSP__EQDC_2_BASE, HSP__EQDC_3_BASE }
  /** Array initializer of EQDC peripheral base pointers */
  #define EQDC_BASE_PTRS                           { HSP__EQDC_0, HSP__EQDC_1, HSP__EQDC_2, HSP__EQDC_3 }
#endif
/** Interrupt vectors for the EQDC peripheral type */
#define EQDC_COMPARE_IRQS                        { HSP_EQDC0_IRQn, HSP_EQDC1_IRQn, HSP_EQDC2_IRQn, HSP_EQDC3_IRQn }
#define EQDC_HOME_IRQS                           { HSP_EQDC0_IRQn, HSP_EQDC1_IRQn, HSP_EQDC2_IRQn, HSP_EQDC3_IRQn }
#define EQDC_WDOG_IRQS                           { HSP_EQDC0_IRQn, HSP_EQDC1_IRQn, HSP_EQDC2_IRQn, HSP_EQDC3_IRQn }
#define EQDC_INDEX_IRQS                          { HSP_EQDC0_IRQn, HSP_EQDC1_IRQn, HSP_EQDC2_IRQn, HSP_EQDC3_IRQn }
#define EQDC_INPUT_SWITCH_IRQS                   { HSP_EQDC0_IRQn, HSP_EQDC1_IRQn, HSP_EQDC2_IRQn, HSP_EQDC3_IRQn }

/* EVTG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__EVTG_0 base address */
  #define HSP__EVTG_0_BASE                         (0x52000000u)
  /** Peripheral HSP__EVTG_0 base address */
  #define HSP__EVTG_0_BASE_NS                      (0x42000000u)
  /** Peripheral HSP__EVTG_0 base pointer */
  #define HSP__EVTG_0                              ((EVTG_Type *)HSP__EVTG_0_BASE)
  /** Peripheral HSP__EVTG_0 base pointer */
  #define HSP__EVTG_0_NS                           ((EVTG_Type *)HSP__EVTG_0_BASE_NS)
  /** Peripheral HSP__EVTG_1 base address */
  #define HSP__EVTG_1_BASE                         (0x52010000u)
  /** Peripheral HSP__EVTG_1 base address */
  #define HSP__EVTG_1_BASE_NS                      (0x42010000u)
  /** Peripheral HSP__EVTG_1 base pointer */
  #define HSP__EVTG_1                              ((EVTG_Type *)HSP__EVTG_1_BASE)
  /** Peripheral HSP__EVTG_1 base pointer */
  #define HSP__EVTG_1_NS                           ((EVTG_Type *)HSP__EVTG_1_BASE_NS)
  /** Peripheral HSP__EVTG_2 base address */
  #define HSP__EVTG_2_BASE                         (0x52800000u)
  /** Peripheral HSP__EVTG_2 base address */
  #define HSP__EVTG_2_BASE_NS                      (0x42800000u)
  /** Peripheral HSP__EVTG_2 base pointer */
  #define HSP__EVTG_2                              ((EVTG_Type *)HSP__EVTG_2_BASE)
  /** Peripheral HSP__EVTG_2 base pointer */
  #define HSP__EVTG_2_NS                           ((EVTG_Type *)HSP__EVTG_2_BASE_NS)
  /** Peripheral HSP__EVTG_3 base address */
  #define HSP__EVTG_3_BASE                         (0x52810000u)
  /** Peripheral HSP__EVTG_3 base address */
  #define HSP__EVTG_3_BASE_NS                      (0x42810000u)
  /** Peripheral HSP__EVTG_3 base pointer */
  #define HSP__EVTG_3                              ((EVTG_Type *)HSP__EVTG_3_BASE)
  /** Peripheral HSP__EVTG_3 base pointer */
  #define HSP__EVTG_3_NS                           ((EVTG_Type *)HSP__EVTG_3_BASE_NS)
  /** Array initializer of EVTG peripheral base addresses */
  #define EVTG_BASE_ADDRS                          { HSP__EVTG_0_BASE, HSP__EVTG_1_BASE, HSP__EVTG_2_BASE, HSP__EVTG_3_BASE }
  /** Array initializer of EVTG peripheral base pointers */
  #define EVTG_BASE_PTRS                           { HSP__EVTG_0, HSP__EVTG_1, HSP__EVTG_2, HSP__EVTG_3 }
  /** Array initializer of EVTG peripheral base addresses */
  #define EVTG_BASE_ADDRS_NS                       { HSP__EVTG_0_BASE_NS, HSP__EVTG_1_BASE_NS, HSP__EVTG_2_BASE_NS, HSP__EVTG_3_BASE_NS }
  /** Array initializer of EVTG peripheral base pointers */
  #define EVTG_BASE_PTRS_NS                        { HSP__EVTG_0_NS, HSP__EVTG_1_NS, HSP__EVTG_2_NS, HSP__EVTG_3_NS }
#else
  /** Peripheral HSP__EVTG_0 base address */
  #define HSP__EVTG_0_BASE                         (0x42000000u)
  /** Peripheral HSP__EVTG_0 base pointer */
  #define HSP__EVTG_0                              ((EVTG_Type *)HSP__EVTG_0_BASE)
  /** Peripheral HSP__EVTG_1 base address */
  #define HSP__EVTG_1_BASE                         (0x42010000u)
  /** Peripheral HSP__EVTG_1 base pointer */
  #define HSP__EVTG_1                              ((EVTG_Type *)HSP__EVTG_1_BASE)
  /** Peripheral HSP__EVTG_2 base address */
  #define HSP__EVTG_2_BASE                         (0x42800000u)
  /** Peripheral HSP__EVTG_2 base pointer */
  #define HSP__EVTG_2                              ((EVTG_Type *)HSP__EVTG_2_BASE)
  /** Peripheral HSP__EVTG_3 base address */
  #define HSP__EVTG_3_BASE                         (0x42810000u)
  /** Peripheral HSP__EVTG_3 base pointer */
  #define HSP__EVTG_3                              ((EVTG_Type *)HSP__EVTG_3_BASE)
  /** Array initializer of EVTG peripheral base addresses */
  #define EVTG_BASE_ADDRS                          { HSP__EVTG_0_BASE, HSP__EVTG_1_BASE, HSP__EVTG_2_BASE, HSP__EVTG_3_BASE }
  /** Array initializer of EVTG peripheral base pointers */
  #define EVTG_BASE_PTRS                           { HSP__EVTG_0, HSP__EVTG_1, HSP__EVTG_2, HSP__EVTG_3 }
#endif

/* EWM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__EWM base address */
  #define WAKE__EWM_BASE                           (0x56110000u)
  /** Peripheral WAKE__EWM base address */
  #define WAKE__EWM_BASE_NS                        (0x46110000u)
  /** Peripheral WAKE__EWM base pointer */
  #define WAKE__EWM                                ((EWM_Type *)WAKE__EWM_BASE)
  /** Peripheral WAKE__EWM base pointer */
  #define WAKE__EWM_NS                             ((EWM_Type *)WAKE__EWM_BASE_NS)
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS                           { WAKE__EWM_BASE }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS                            { WAKE__EWM }
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS_NS                        { WAKE__EWM_BASE_NS }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS_NS                         { WAKE__EWM_NS }
#else
  /** Peripheral WAKE__EWM base address */
  #define WAKE__EWM_BASE                           (0x46110000u)
  /** Peripheral WAKE__EWM base pointer */
  #define WAKE__EWM                                ((EWM_Type *)WAKE__EWM_BASE)
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS                           { WAKE__EWM_BASE }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS                            { WAKE__EWM }
#endif
/** Interrupt vectors for the EWM peripheral type */
#define EWM_IRQS                                 { WAKE_EWM_IRQn }

/* FLEXIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__FLEXIO_0 base address */
  #define HSP__FLEXIO_0_BASE                       (0x52110000u)
  /** Peripheral HSP__FLEXIO_0 base address */
  #define HSP__FLEXIO_0_BASE_NS                    (0x42110000u)
  /** Peripheral HSP__FLEXIO_0 base pointer */
  #define HSP__FLEXIO_0                            ((FLEXIO_Type *)HSP__FLEXIO_0_BASE)
  /** Peripheral HSP__FLEXIO_0 base pointer */
  #define HSP__FLEXIO_0_NS                         ((FLEXIO_Type *)HSP__FLEXIO_0_BASE_NS)
  /** Peripheral HSP__FLEXIO_1 base address */
  #define HSP__FLEXIO_1_BASE                       (0x52120000u)
  /** Peripheral HSP__FLEXIO_1 base address */
  #define HSP__FLEXIO_1_BASE_NS                    (0x42120000u)
  /** Peripheral HSP__FLEXIO_1 base pointer */
  #define HSP__FLEXIO_1                            ((FLEXIO_Type *)HSP__FLEXIO_1_BASE)
  /** Peripheral HSP__FLEXIO_1 base pointer */
  #define HSP__FLEXIO_1_NS                         ((FLEXIO_Type *)HSP__FLEXIO_1_BASE_NS)
  /** Peripheral HSP__FLEXIO_2 base address */
  #define HSP__FLEXIO_2_BASE                       (0x52900000u)
  /** Peripheral HSP__FLEXIO_2 base address */
  #define HSP__FLEXIO_2_BASE_NS                    (0x42900000u)
  /** Peripheral HSP__FLEXIO_2 base pointer */
  #define HSP__FLEXIO_2                            ((FLEXIO_Type *)HSP__FLEXIO_2_BASE)
  /** Peripheral HSP__FLEXIO_2 base pointer */
  #define HSP__FLEXIO_2_NS                         ((FLEXIO_Type *)HSP__FLEXIO_2_BASE_NS)
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS                        { HSP__FLEXIO_0_BASE, HSP__FLEXIO_1_BASE, HSP__FLEXIO_2_BASE }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS                         { HSP__FLEXIO_0, HSP__FLEXIO_1, HSP__FLEXIO_2 }
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS_NS                     { HSP__FLEXIO_0_BASE_NS, HSP__FLEXIO_1_BASE_NS, HSP__FLEXIO_2_BASE_NS }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS_NS                      { HSP__FLEXIO_0_NS, HSP__FLEXIO_1_NS, HSP__FLEXIO_2_NS }
#else
  /** Peripheral HSP__FLEXIO_0 base address */
  #define HSP__FLEXIO_0_BASE                       (0x42110000u)
  /** Peripheral HSP__FLEXIO_0 base pointer */
  #define HSP__FLEXIO_0                            ((FLEXIO_Type *)HSP__FLEXIO_0_BASE)
  /** Peripheral HSP__FLEXIO_1 base address */
  #define HSP__FLEXIO_1_BASE                       (0x42120000u)
  /** Peripheral HSP__FLEXIO_1 base pointer */
  #define HSP__FLEXIO_1                            ((FLEXIO_Type *)HSP__FLEXIO_1_BASE)
  /** Peripheral HSP__FLEXIO_2 base address */
  #define HSP__FLEXIO_2_BASE                       (0x42900000u)
  /** Peripheral HSP__FLEXIO_2 base pointer */
  #define HSP__FLEXIO_2                            ((FLEXIO_Type *)HSP__FLEXIO_2_BASE)
  /** Array initializer of FLEXIO peripheral base addresses */
  #define FLEXIO_BASE_ADDRS                        { HSP__FLEXIO_0_BASE, HSP__FLEXIO_1_BASE, HSP__FLEXIO_2_BASE }
  /** Array initializer of FLEXIO peripheral base pointers */
  #define FLEXIO_BASE_PTRS                         { HSP__FLEXIO_0, HSP__FLEXIO_1, HSP__FLEXIO_2 }
#endif
/** Interrupt vectors for the FLEXIO peripheral type */
#define FLEXIO_IRQS                              { HSP_FLEXIO0_IRQn, HSP_FLEXIO1_IRQn, HSP_FLEXIO2_IRQn }

/* FLEXSPI_SLV - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__FLEXSPI_FLR base address */
  #define COMM__FLEXSPI_FLR_BASE                   (0x5A0E0000u)
  /** Peripheral COMM__FLEXSPI_FLR base address */
  #define COMM__FLEXSPI_FLR_BASE_NS                (0x4A0E0000u)
  /** Peripheral COMM__FLEXSPI_FLR base pointer */
  #define COMM__FLEXSPI_FLR                        ((FLEXSPI_SLV_Type *)COMM__FLEXSPI_FLR_BASE)
  /** Peripheral COMM__FLEXSPI_FLR base pointer */
  #define COMM__FLEXSPI_FLR_NS                     ((FLEXSPI_SLV_Type *)COMM__FLEXSPI_FLR_BASE_NS)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { COMM__FLEXSPI_FLR_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { COMM__FLEXSPI_FLR }
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS_NS                { COMM__FLEXSPI_FLR_BASE_NS }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS_NS                 { COMM__FLEXSPI_FLR_NS }
#else
  /** Peripheral COMM__FLEXSPI_FLR base address */
  #define COMM__FLEXSPI_FLR_BASE                   (0x4A0E0000u)
  /** Peripheral COMM__FLEXSPI_FLR base pointer */
  #define COMM__FLEXSPI_FLR                        ((FLEXSPI_SLV_Type *)COMM__FLEXSPI_FLR_BASE)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { COMM__FLEXSPI_FLR_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { COMM__FLEXSPI_FLR }
#endif
/** Interrupt vectors for the FLEXSPI_SLV peripheral type */
#define FLEXSPI_SLV_IRQS                         { COMM_FLEXSPI_SLV_IRQn }

