zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/MIMXRT2661_COMMON.h
/* IOMUXC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__IOMUXC base address */
  #define MAIN__IOMUXC_BASE                        (0x521C0000u)
  /** Peripheral MAIN__IOMUXC base address */
  #define MAIN__IOMUXC_BASE_NS                     (0x421C0000u)
  /** Peripheral MAIN__IOMUXC base pointer */
  #define MAIN__IOMUXC                             ((IOMUXC_Type *)MAIN__IOMUXC_BASE)
  /** Peripheral MAIN__IOMUXC base pointer */
  #define MAIN__IOMUXC_NS                          ((IOMUXC_Type *)MAIN__IOMUXC_BASE_NS)
  /** Peripheral VBAT__IOMUXC base address */
  #define VBAT__IOMUXC_BASE                        (0x56360000u)
  /** Peripheral VBAT__IOMUXC base address */
  #define VBAT__IOMUXC_BASE_NS                     (0x46360000u)
  /** Peripheral VBAT__IOMUXC base pointer */
  #define VBAT__IOMUXC                             ((IOMUXC_Type *)VBAT__IOMUXC_BASE)
  /** Peripheral VBAT__IOMUXC base pointer */
  #define VBAT__IOMUXC_NS                          ((IOMUXC_Type *)VBAT__IOMUXC_BASE_NS)
  /** Peripheral WAKE__IOMUXC base address */
  #define WAKE__IOMUXC_BASE                        (0x56220000u)
  /** Peripheral WAKE__IOMUXC base address */
  #define WAKE__IOMUXC_BASE_NS                     (0x46220000u)
  /** Peripheral WAKE__IOMUXC base pointer */
  #define WAKE__IOMUXC                             ((IOMUXC_Type *)WAKE__IOMUXC_BASE)
  /** Peripheral WAKE__IOMUXC base pointer */
  #define WAKE__IOMUXC_NS                          ((IOMUXC_Type *)WAKE__IOMUXC_BASE_NS)
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS                        { MAIN__IOMUXC_BASE, VBAT__IOMUXC_BASE, WAKE__IOMUXC_BASE }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS                         { MAIN__IOMUXC, VBAT__IOMUXC, WAKE__IOMUXC }
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS_NS                     { MAIN__IOMUXC_BASE_NS, VBAT__IOMUXC_BASE_NS, WAKE__IOMUXC_BASE_NS }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS_NS                      { MAIN__IOMUXC_NS, VBAT__IOMUXC_NS, WAKE__IOMUXC_NS }
#else
  /** Peripheral MAIN__IOMUXC base address */
  #define MAIN__IOMUXC_BASE                        (0x421C0000u)
  /** Peripheral MAIN__IOMUXC base pointer */
  #define MAIN__IOMUXC                             ((IOMUXC_Type *)MAIN__IOMUXC_BASE)
  /** Peripheral VBAT__IOMUXC base address */
  #define VBAT__IOMUXC_BASE                        (0x46360000u)
  /** Peripheral VBAT__IOMUXC base pointer */
  #define VBAT__IOMUXC                             ((IOMUXC_Type *)VBAT__IOMUXC_BASE)
  /** Peripheral WAKE__IOMUXC base address */
  #define WAKE__IOMUXC_BASE                        (0x46220000u)
  /** Peripheral WAKE__IOMUXC base pointer */
  #define WAKE__IOMUXC                             ((IOMUXC_Type *)WAKE__IOMUXC_BASE)
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS                        { MAIN__IOMUXC_BASE, VBAT__IOMUXC_BASE, WAKE__IOMUXC_BASE }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS                         { MAIN__IOMUXC, VBAT__IOMUXC, WAKE__IOMUXC }
#endif

/* ISI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__ISI base address */
  #define MEDIA__ISI_BASE                          (0x5C120000u)
  /** Peripheral MEDIA__ISI base address */
  #define MEDIA__ISI_BASE_NS                       (0x4C120000u)
  /** Peripheral MEDIA__ISI base pointer */
  #define MEDIA__ISI                               ((ISI_Type *)MEDIA__ISI_BASE)
  /** Peripheral MEDIA__ISI base pointer */
  #define MEDIA__ISI_NS                            ((ISI_Type *)MEDIA__ISI_BASE_NS)
  /** Array initializer of ISI peripheral base addresses */
  #define ISI_BASE_ADDRS                           { MEDIA__ISI_BASE }
  /** Array initializer of ISI peripheral base pointers */
  #define ISI_BASE_PTRS                            { MEDIA__ISI }
  /** Array initializer of ISI peripheral base addresses */
  #define ISI_BASE_ADDRS_NS                        { MEDIA__ISI_BASE_NS }
  /** Array initializer of ISI peripheral base pointers */
  #define ISI_BASE_PTRS_NS                         { MEDIA__ISI_NS }
#else
  /** Peripheral MEDIA__ISI base address */
  #define MEDIA__ISI_BASE                          (0x4C120000u)
  /** Peripheral MEDIA__ISI base pointer */
  #define MEDIA__ISI                               ((ISI_Type *)MEDIA__ISI_BASE)
  /** Array initializer of ISI peripheral base addresses */
  #define ISI_BASE_ADDRS                           { MEDIA__ISI_BASE }
  /** Array initializer of ISI peripheral base pointers */
  #define ISI_BASE_PTRS                            { MEDIA__ISI }
#endif
/** Interrupt vectors for the ISI peripheral type */
#define ISI_IRQS                                 { MEDIA_ISI_IRQn }

/* JPEGDEC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__JPEGDEC base address */
  #define MEDIA__JPEGDEC_BASE                      (0x5C0C0100u)
  /** Peripheral MEDIA__JPEGDEC base address */
  #define MEDIA__JPEGDEC_BASE_NS                   (0x4C0C0100u)
  /** Peripheral MEDIA__JPEGDEC base pointer */
  #define MEDIA__JPEGDEC                           ((JPEGDEC_Type *)MEDIA__JPEGDEC_BASE)
  /** Peripheral MEDIA__JPEGDEC base pointer */
  #define MEDIA__JPEGDEC_NS                        ((JPEGDEC_Type *)MEDIA__JPEGDEC_BASE_NS)
  /** Array initializer of JPEGDEC peripheral base addresses */
  #define JPEGDEC_BASE_ADDRS                       { MEDIA__JPEGDEC_BASE }
  /** Array initializer of JPEGDEC peripheral base pointers */
  #define JPEGDEC_BASE_PTRS                        { MEDIA__JPEGDEC }
  /** Array initializer of JPEGDEC peripheral base addresses */
  #define JPEGDEC_BASE_ADDRS_NS                    { MEDIA__JPEGDEC_BASE_NS }
  /** Array initializer of JPEGDEC peripheral base pointers */
  #define JPEGDEC_BASE_PTRS_NS                     { MEDIA__JPEGDEC_NS }
#else
  /** Peripheral MEDIA__JPEGDEC base address */
  #define MEDIA__JPEGDEC_BASE                      (0x4C0C0100u)
  /** Peripheral MEDIA__JPEGDEC base pointer */
  #define MEDIA__JPEGDEC                           ((JPEGDEC_Type *)MEDIA__JPEGDEC_BASE)
  /** Array initializer of JPEGDEC peripheral base addresses */
  #define JPEGDEC_BASE_ADDRS                       { MEDIA__JPEGDEC_BASE }
  /** Array initializer of JPEGDEC peripheral base pointers */
  #define JPEGDEC_BASE_PTRS                        { MEDIA__JPEGDEC }
#endif

/* JPGDECWRP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__JPGDECWRP base address */
  #define MEDIA__JPGDECWRP_BASE                    (0x5C0C0000u)
  /** Peripheral MEDIA__JPGDECWRP base address */
  #define MEDIA__JPGDECWRP_BASE_NS                 (0x4C0C0000u)
  /** Peripheral MEDIA__JPGDECWRP base pointer */
  #define MEDIA__JPGDECWRP                         ((JPGDECWRP_Type *)MEDIA__JPGDECWRP_BASE)
  /** Peripheral MEDIA__JPGDECWRP base pointer */
  #define MEDIA__JPGDECWRP_NS                      ((JPGDECWRP_Type *)MEDIA__JPGDECWRP_BASE_NS)
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS                     { MEDIA__JPGDECWRP_BASE }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS                      { MEDIA__JPGDECWRP }
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS_NS                  { MEDIA__JPGDECWRP_BASE_NS }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS_NS                   { MEDIA__JPGDECWRP_NS }
#else
  /** Peripheral MEDIA__JPGDECWRP base address */
  #define MEDIA__JPGDECWRP_BASE                    (0x4C0C0000u)
  /** Peripheral MEDIA__JPGDECWRP base pointer */
  #define MEDIA__JPGDECWRP                         ((JPGDECWRP_Type *)MEDIA__JPGDECWRP_BASE)
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS                     { MEDIA__JPGDECWRP_BASE }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS                      { MEDIA__JPGDECWRP }
#endif

